#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Очищает все записи регистра.
Процедура ОчиститьЗаписиРегистра() Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

// Создать запись в регистр сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Пользователь - СправочникСсылка.Пользователи
//  Этап - СправочникСсылка.cbr_КонтрольНадЭтапамиЗадач.
Процедура ЗаписатьПросроченноеДействие(Задача, Пользователь, Этап) Экспорт
	РуководительПользователя = cbr_ОбработчикиФормыЗадачиСервер.РуководительПользователя(Пользователь);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Этап = Этап;
	МенеджерЗаписи.Руководитель = РуководительПользователя;
	МенеджерЗаписи.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли