#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяСтрока = Параметры.ТекущаяСтрока;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПослеОткрытия", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия()
	Элементы.Список.ТекущаяСтрока = ?(ЗначениеЗаполнено(ТекущаяСтрока), ТекущаяСтрока, Неопределено);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьЗначение(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.гбФункцииКнопки.ПустаяСсылка"));
КонецПроцедуры

#КонецОбласти

