#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет отключение узла от обмена.
//
// Параметры:
//  УзелОбмена			 - ПланыОбменаСсылка	 - Узел обмена.
//  ПометитьНаУдаление	 - Булево				 - Признак установки пометки удаления.
//
Процедура ОтключитьПользователя(УзелОбмена, ПометитьНаУдаление = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
	
	НЗ = РегистрыСведений.CRM_ДанныеДляВыгрузкиВiCRM.СоздатьНаборЗаписей();
	НЗ.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НЗ.Отбор.УзелОбмена.Установить(УзелОбмена);
	НЗ.Записать(Истина);
	
	Если ПометитьНаУдаление Тогда
		УзелОбъект = УзелОбмена.ПолучитьОбъект();
		УзелОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#КонецЕсли
