#Область ПрограммныйИнтерфейс
#Область ЗаполнениеПолей
//Заполняет поля формы по настройкам пользователя
//Параметры: 
// ЭтаФорма - Форма
Процедура ЗаполнитьПользовательскиеНастройки(ЭтаФорма) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_ПользовательскиеНастройки.Значение,
		|	cbr_ПользовательскиеНастройки.ВидНастройки
		|ИЗ
		|	РегистрСведений.cbr_ПользовательскиеНастройки КАК cbr_ПользовательскиеНастройки
		|ГДЕ
		|	cbr_ПользовательскиеНастройки.Пользователь = &Пользователь
		|	И
		|		cbr_ПользовательскиеНастройки.ВидНастройки.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.НачальноеЗаполнениеЗадачи)
		|	И НЕ cbr_ПользовательскиеНастройки.ВидНастройки.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Исполнитель") Тогда
			ЭтаФорма.Исполнитель = Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//Заполняет поля формы по настройкам пользователя
//Возвращаемое значение:
//	Булево
Функция ЕстьПользовательскиеНастройки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_ПользовательскиеНастройки.Значение,
		|	cbr_ПользовательскиеНастройки.ВидНастройки
		|ИЗ
		|	РегистрСведений.cbr_ПользовательскиеНастройки КАК cbr_ПользовательскиеНастройки
		|ГДЕ
		|	cbr_ПользовательскиеНастройки.Пользователь = &Пользователь
		|	И
		|		cbr_ПользовательскиеНастройки.ВидНастройки.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.НачальноеЗаполнениеЗадачи)
		|	И НЕ cbr_ПользовательскиеНастройки.ВидНастройки.ЭтоГруппа
		|	И cbr_ПользовательскиеНастройки.Значение <> НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

//Заполняет данные объекта из источника
//Параметры: 
// ЭтаФорма - Форма
// Источник - ДокументСсылка.cbr_Задача
Процедура ЗаполнитьНаследуемыеПараметры(ЭтаФорма, Источник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_Задача.ВидЗадачи,
		|	cbr_Задача.Постановщик КАК Постановщик,
		|	cbr_Задача.УчетВремени,
		|	cbr_Задача.КонтрольВремени,
		|	cbr_Задача.Приоритет,
		|	cbr_Задача.ГлавныйМенеджер
		|ИЗ
		|	Документ.cbr_Задача КАК cbr_Задача
		|ГДЕ
		|	cbr_Задача.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	cbr_ЗадачаНаблюдатели.Пользователь
		|ИЗ
		|	Документ.cbr_Задача.Наблюдатели КАК cbr_ЗадачаНаблюдатели
		|ГДЕ
		|	cbr_ЗадачаНаблюдатели.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаОсновныеПараметры = РезультатЗапроса[0].Выбрать();
	Если ВыборкаОсновныеПараметры.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, ВыборкаОсновныеПараметры);
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаОсновныеПараметры.ВидЗадачи, "Партнер") Тогда
			ЭтаФорма.Объект.Постановщик = ВыборкаОсновныеПараметры.Постановщик;
			ЭтаФорма.Исполнитель = ВыборкаОсновныеПараметры.ГлавныйМенеджер;
		Иначе
			ЭтаФорма.Объект.Постановщик = Пользователи.АвторизованныйПользователь();
			ЭтаФорма.Исполнитель = ВыборкаОсновныеПараметры.Постановщик;
		КонецЕсли
	КонецЕсли;
	
	ВыборкаНаблюдатели = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаНаблюдатели.Следующий() Цикл
		НоваяСтрокаНаблюдателей = ЭтаФорма.Объект.Наблюдатели.Добавить();
		НоваяСтрокаНаблюдателей.Пользователь = ВыборкаНаблюдатели.Пользователь;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецОбласти