#Область ПрограммныйИнтерфейс
#Область ЗаполнениеПолей
// Заполняет поля формы по настройкам пользователя
// 
// Параметры: 
//   ЭтаФорма - ФормаКлиентскогоПриложения
//
Процедура ЗаполнитьПользовательскиеНастройки(ЭтаФорма) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	cbr_ПользовательскиеНастройки.Значение,
	|	cbr_ПользовательскиеНастройки.ВидНастройки
	|ИЗ
	|	РегистрСведений.cbr_ПользовательскиеНастройки КАК cbr_ПользовательскиеНастройки
	|ГДЕ
	|	cbr_ПользовательскиеНастройки.Пользователь = &Пользователь
	|	И
	|		cbr_ПользовательскиеНастройки.ВидНастройки.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.НачальноеЗаполнениеЗадачи)
	|	И НЕ cbr_ПользовательскиеНастройки.ВидНастройки.ЭтоГруппа";

	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Исполнитель") Тогда
			ЭтаФорма.Исполнитель = Выборка.Значение;
			
			ДобавитьНаблюдателяОтИсполнителя(ЭтаФорма);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Добавляет в наблюдателей руководителя текущего исполнителя
// 
// Параметры: 
//   ЭтаФорма - ФормаКлиентскогоПриложения
Процедура ДобавитьНаблюдателяОтИсполнителя(ЭтаФорма) Экспорт
	Наблюдатель = Неопределено;
	
	Если ТипЗнч(ЭтаФорма.Исполнитель) = Тип("СправочникСсылка.cbr_ГруппыДоступаКЗадачам") Тогда
		Наблюдатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Исполнитель, "Руководитель");
	КонецЕсли;

	Если ТипЗнч(ЭтаФорма.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Исполнитель, "Подразделение");
		Если ЗначениеЗаполнено(Подразделение) Тогда
			НаблюдательФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "ТекущийРуководитель");
		
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Пользователи.Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо";
			
			Запрос.УстановитьПараметр("ФизическоеЛицо", НаблюдательФизЛицо);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Наблюдатель = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Наблюдатель <> Неопределено Тогда
		НовыйНаблюдатель = ЭтаФорма.Объект.Наблюдатели.Добавить();
		НовыйНаблюдатель.Пользователь = Наблюдатель;
	КонецЕсли;
КонецПроцедуры

// Добавляет в наблюдателей руководителя текущего исполнителя
// 
// Параметры: 
//   ЭтаФорма - ФормаКлиентскогоПриложения
//
Процедура ДобавитьНаблюдателяОтМенеджера(ЭтаФорма) Экспорт
    Наблюдатель = Неопределено;
    
    Если ТипЗнч(ЭтаФорма.Объект.Постановщик) = Тип("СправочникСсылка.Партнеры") Тогда
        Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Объект.ГлавныйМенеджер, "Подразделение");
        Если ЗначениеЗаполнено(Подразделение) Тогда
            НаблюдательФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "ТекущийРуководитель");
        КонецЕсли;
    КонецЕсли;

    Если ТипЗнч(ЭтаФорма.Объект.Постановщик) = Тип("СправочникСсылка.Пользователи") Тогда
        Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Объект.Постановщик, "Подразделение");
        Если ЗначениеЗаполнено(Подразделение) Тогда
            НаблюдательФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "ТекущийРуководитель");
        КонецЕсли;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(НаблюдательФизЛицо) Тогда
        Запрос = Новый Запрос;
        Запрос.Текст =
            "ВЫБРАТЬ
            |    Пользователи.Ссылка
            |ИЗ
            |    Справочник.Пользователи КАК Пользователи
            |ГДЕ
            |    Пользователи.ФизическоеЛицо = &ФизическоеЛицо";
        
        Запрос.УстановитьПараметр("ФизическоеЛицо", НаблюдательФизЛицо);
        Выборка = Запрос.Выполнить().Выбрать();
                
        Если Выборка.Следующий() Тогда
            Наблюдатель = Выборка.Ссылка;
        КонецЕсли;
    КонецЕсли;

    Если Наблюдатель <> Неопределено Тогда
        НовыйНаблюдатель = ЭтаФорма.Объект.Наблюдатели.Добавить();
        НовыйНаблюдатель.Пользователь = Наблюдатель;
    КонецЕсли;
КонецПроцедуры

// Заполняет поля формы по настройкам пользователя
// Возвращаемое значение:
//  Булево
Функция ЕстьПользовательскиеНастройки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	cbr_ПользовательскиеНастройки.Значение,
	|	cbr_ПользовательскиеНастройки.ВидНастройки
	|ИЗ
	|	РегистрСведений.cbr_ПользовательскиеНастройки КАК cbr_ПользовательскиеНастройки
	|ГДЕ
	|	cbr_ПользовательскиеНастройки.Пользователь = &Пользователь
	|	И
	|		cbr_ПользовательскиеНастройки.ВидНастройки.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.НачальноеЗаполнениеЗадачи)
	|	И НЕ cbr_ПользовательскиеНастройки.ВидНастройки.ЭтоГруппа
	|	И cbr_ПользовательскиеНастройки.Значение <> НЕОПРЕДЕЛЕНО";

	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

// Заполняет данные объекта из источника
// Параметры: 
// ЭтаФорма - Форма
// Источник - ДокументСсылка.cbr_Задача
Процедура ЗаполнитьНаследуемыеПараметры(ЭтаФорма, Источник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	cbr_Задача.ВидЗадачи,
	|	cbr_Задача.Постановщик КАК Постановщик,
	|	cbr_Задача.УчетВремени,
	|	cbr_Задача.КонтрольВремени,
	|	cbr_Задача.Приоритет,
	|	cbr_Задача.ГлавныйМенеджер
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_ЗадачаНаблюдатели.Пользователь
	|ИЗ
	|	Документ.cbr_Задача.Наблюдатели КАК cbr_ЗадачаНаблюдатели
	|ГДЕ
	|	cbr_ЗадачаНаблюдатели.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Источник);

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	ВыборкаОсновныеПараметры = РезультатЗапроса[0].Выбрать();
	Если ВыборкаОсновныеПараметры.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, ВыборкаОсновныеПараметры);

		ЭтоПартнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаОсновныеПараметры.ВидЗадачи, "Партнер");
		Если ЭтоПартнер Тогда
			ЭтаФорма.Объект.Постановщик = ВыборкаОсновныеПараметры.Постановщик;
			ЭтаФорма.Исполнитель = ВыборкаОсновныеПараметры.ГлавныйМенеджер;
		Иначе
			ЭтаФорма.Объект.Постановщик = Пользователи.АвторизованныйПользователь();
			ЭтаФорма.Исполнитель = ВыборкаОсновныеПараметры.Постановщик;
		КонецЕсли;
	КонецЕсли;

	ВыборкаНаблюдатели = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаНаблюдатели.Следующий() Цикл
		НоваяСтрокаНаблюдателей = ЭтаФорма.Объект.Наблюдатели.Добавить();
		НоваяСтрокаНаблюдателей.Пользователь = ВыборкаНаблюдатели.Пользователь;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецОбласти