
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.Клиенты.Заявка.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
	
	ОткрытьФорму("Документ.CRM_Заявка.Форма.ФормаДокументаНовая", ПараметрыФормы,
		 ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, , , ,
		 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
