#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Отказ = ЕстьПересечениеИнтерваловСДругимиПоказателями();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьПересечениеИнтерваловСДругимиПоказателями()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА CRM_ИнтервалыВремениНаСайте.min <= &min
	|				И CRM_ИнтервалыВремениНаСайте.max >= &min
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МинимальноеЧисло,
	|	ВЫБОР
	|		КОГДА CRM_ИнтервалыВремениНаСайте.min <= &max
	|				И CRM_ИнтервалыВремениНаСайте.max >= &max
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаксимальноеЧисло
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.CRM_ИнтервалыВремениНаСайте КАК CRM_ИнтервалыВремениНаСайте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.МинимальноеЧисло КАК МинимальноеЧисло,
	|	ВТ.МаксимальноеЧисло КАК МаксимальноеЧисло
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.МинимальноеЧисло
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.МинимальноеЧисло,
	|	ВТ.МаксимальноеЧисло
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.МаксимальноеЧисло";
	
	Запрос.УстановитьПараметр("max", max);
	Запрос.УстановитьПараметр("min", min);
	
	ЕстьПересечение = Не Запрос.Выполнить().Пустой();
	Если ЕстьПересечение Тогда
		ТекстСообщения = НСтр("ru = 'Заданные числа пересекаются с другими показателями, необходимо изменить значения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат ЕстьПересечение;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
