
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДополнительноеУсловие = "";
	Если Параметры.Источник = "Источник" Тогда
		ВидСправочника = "CRM_ИсточникиПолученияЛидов";
		Заголовок = "Источники получения заявок";
		ДополнительноеУсловие = "И ИсточникЛидов.Включено";
	ИначеЕсли Параметры.Источник = "Почта" Тогда
		ВидСправочника = "УчетныеЗаписиЭлектроннойПочты";
		Заголовок = "Учетные записи электронной почты";
	ИначеЕсли Параметры.Источник = "Мессенджер" Тогда
		ВидСправочника = "CRM_УчетныеЗаписиМессенджеров";
		Заголовок = "Учетные записи мессенджеров и социальных сетей";
		ДополнительноеУсловие = "И ИсточникЛидов.Включена";
	КонецЕсли;
	СписокЛидов.ТекстЗапроса = "ВЫБРАТЬ
		                           |	ИсточникЛидов.Ссылка КАК Ссылка,
		                           |	ИсточникЛидов.CRM_ИсточникЛидов КАК CRM_ИсточникЛидов
		                           |ИЗ
		                           |	Справочник." + ВидСправочника + " КАК ИсточникЛидов
		                           |ГДЕ НЕ ИсточникЛидов.ПометкаУдаления
		                           |" + ДополнительноеУсловие;
	СписокЛидов.ОсновнаяТаблица = "Справочник." + ВидСправочника;
	Элементы.СписокЛидов.РежимВыбора = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЛидовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элемент.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СписокЛидовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Закрыть(Элемент.ВыделенныеСтроки);
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЛидовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ВидСправочника = "CRM_УчетныеЗаписиМессенджеров" Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.CRM_ВыборКаналаДиалогов", , ЭтотОбъект, , , , ОписаниеОповещения,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если ВидСправочника = "CRM_УчетныеЗаписиМессенджеров" Тогда
			ПараметрыФормы = Новый Структура("ТипМессенджера", Результат);
			ОткрытьФорму("Справочник.CRM_УчетныеЗаписиМессенджеров.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
