
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МетаданныеРасширения = гбСерверПовтИсп.ПолучитьМетаданныеРасширения("Имя, Синоним");
	Заголовок = МетаданныеРасширения.Синоним;
	ИмяРасширения = МетаданныеРасширения.Имя;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы тогда
		Возврат;
	КонецЕсли;
	КлючЛицензирования = гбСервер.ПолучитьЗначениеИзХранилищаОбщихНастроек("НастройкиПрограммы/НастройкиЛицензирования",
			ИмяРасширения + "/КлючЛицензирования", "");
	Если ВладелецФормы <> Неопределено тогда
		ВладелецФормы.ТолькоПросмотр = ПустаяСтрока(КлючЛицензирования);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КлючЛицензирования = гбСервер.ПолучитьЗначениеИзХранилищаОбщихНастроек("НастройкиПрограммы/НастройкиЛицензирования",
			ИмяРасширения + "/КлючЛицензирования", "");
	Если ВладелецФормы <> Неопределено и не ПустаяСтрока(КлючЛицензирования) тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	Если гбКлиентСервер.ЭтоУникальныйИдентификатор(КлючЛицензирования) тогда
		гбСервер.СохранитьЗначениеВХранилищеОбщихНастроек("НастройкиПрограммы/НастройкиЛицензирования",
			ИмяРасширения + "/КлючЛицензирования", КлючЛицензирования);
		Закрыть();
	Иначе
		ПоказатьПредупреждение(, "Неверный формат ключа лицензирования", 3);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти



