
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.АРМДиалоги.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
	ПараметрыФормы = Новый Структура("ПараметрОткрытия", ПараметрКоманды);
	ОткрытьФорму("Обработка.CRM_Мессенджер.Форма.ФормаМессенджера", ПараметрыФормы,
		 ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		 ПараметрыВыполненияКоманды.Окно,
		 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
