#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователи
&НаКлиенте
Процедура ПользователиПользовательПриИзменении(Элемент)
	ПользователиПользовательПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура("РежимВыбора,РасширенныйПодбор,ЗакрыватьПриВыборе",
		Истина, Истина, Ложь);
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыПодбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.Пользователи.Форма.CRM_ФормаСписка", ПараметрыФормы, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыПодбора(Результат, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Для Индекс = 0 По Результат.Вграница() Цикл
			НоваяСтрока = Объект.Пользователи.Добавить();
			НоваяСтрока.Пользователь = Результат[Индекс];
		КонецЦикла;
	КонецЕсли;
	ПользователиПользовательПриИзмененииНаСервере();
 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПользователиПользовательПриИзмененииНаСервере()
	ТаблицаПользователей = Объект.Пользователи.Выгрузить();
	ТаблицаПользователей.Свернуть("Пользователь");
	Объект.Пользователи.Загрузить(ТаблицаПользователей);
КонецПроцедуры

#КонецОбласти