
&НаКлиенте
Процедура ПользователиПользовательПриИзменении(Элемент)
	ПользователиПользовательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПользователиПользовательПриИзмененииНаСервере()
	ТаблицаПользователей = Объект.Пользователи.Выгрузить();
	ТаблицаПользователей.Свернуть("Пользователь");	
	Объект.Пользователи.Загрузить(ТаблицаПользователей);
КонецПроцедуры

&НаСервере
Процедура ПодборНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СправочникПользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК СправочникПользователи
		|ГДЕ
		|	СправочникПользователи.Подразделение В (&Подразделение)";
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Объект.Пользователи.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПодборНаСервере();
КонецПроцедуры
