
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	Если НЕ CRM_РежимФормЗакладкиСервер.ВосстановлениеФормыПриЗапускеСеанса(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// -Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗаполнитьПодменюСозданияПоШаблону();

	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// -Рабочий стол
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	ПриЗакрытииНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ПроцедурыДействияКомандныхПанелейФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	РазрешеноИзменениеПроектов = РазрешеноГрупповоеИзменениеПроектов();
	
	Если РазрешеноИзменениеПроектов Тогда
	
		ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);	
	
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='Команда ""Изменить выделенное"" доступна только пользователям,
			| у которых есть одна из следующих ролей: "
"- ""Полные права"", "
"- ""Управление маркетингом"", "
"- ""Добавление и изменение базовой нормативно-справочной информации"".';en='Command ""Change selected"" available only to users who have one of following roles:"
"- ""Full rights"","
"- ""Marketing management"","
"- ""Adding and changind of basic normative-reference information"".'"));
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстанавливатьФормуПриОткрытии(Команда)
	Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка = НЕ Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка;
	CRM_ХранилищеНастроек.Сохранить(ИмяФормы, "ВосстанавливатьФормуПриОткрытии",
		 Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроектПоШаблону(Команда)
	ШаблонПроекта = ПолучитьШаблонПроектаСервер(СтрЗаменить(СтрЗаменить(Команда.Имя, "Шаблон", ""), "_", "-"));
	СозданныйПроект = Неопределено;
	CRM_УправлениеПроектамиВызовСервера.СоздатьПроектПоШаблону(ШаблонПроекта, СозданныйПроект);
	Если СозданныйПроект <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ОткрытьСозданныйПроект", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокШаблонов()
	ОткрытьФорму("Справочник.CRM_ШаблоныПроектов.ФормаВыбора", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблонНаОснованииПроекта(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		CRM_УправлениеПроектамиКлиент.СоздатьШаблонНаОснованииПроекта(ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИнтересы(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Проект", ТекущиеДанные.Ссылка);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	ОткрытьФорму("Документ.CRM_Интерес.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // ПроцедурыДействияКомандныхПанелейФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПодменюСозданияПоШаблону()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 10
	                      |	CRM_ШаблоныПроектов.Ссылка КАК Ссылка,
	                      |	CRM_ШаблоныПроектов.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.CRM_ШаблоныПроектов КАК CRM_ШаблоныПроектов
	                      |ГДЕ
	                      |	НЕ CRM_ШаблоныПроектов.ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Команда = Команды.Добавить("Шаблон" + СтрЗаменить(Строка(Выборка.Ссылка.УникальныйИдентификатор()), "-", "_"));
		Команда.Действие = "СоздатьПроектПоШаблону";
		Команда.Заголовок = Выборка.Наименование;
		
		Элемент = Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), Элементы.СоздатьПоШаблону);
		Элемент.ИмяКоманды = Команда.Имя;
	КонецЦикла;
	Команда = Команды.Добавить("ОткрытьСписокШаблонов");
	Команда.Действие = "ОткрытьСписокШаблонов";
	Команда.Заголовок = НСтр("ru='Показать все...'");
		
	Группа = Элементы.Добавить("Группа" + Команда.Имя, Тип("ГруппаФормы"), Элементы.СоздатьПоШаблону);
	Группа.Вид = ВидГруппыФормы.ГруппаКнопок;
	Элемент = Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), Группа);
	Элемент.ИмяКоманды = Команда.Имя;
КонецПроцедуры
	
&НаСервере
Функция ПолучитьШаблонПроектаСервер(СтрУникальныйИдентификатор)
	Возврат Справочники.CRM_ШаблоныПроектов.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрУникальныйИдентификатор));
КонецФункции

&НаКлиенте
Процедура ОткрытьСозданныйПроект()

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", СозданныйПроект);
	ОткрытьФорму("Справочник.Проекты.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазрешеноГрупповоеИзменениеПроектов()

  Возврат Пользователи.РолиДоступны("CRM_УправлениеПроектами, CRM_ДобавлениеИзменениеБазовойНСИ, ПолныеПрава");

КонецФункции // РазрешеноГрупповоеИзменениеПроектов()

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	CRM_РежимФормЗакладкиСервер.ПриЗакрытииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.CRM_ШаблоныПроектов.Форма.ФормаВыбора" Тогда
		СозданныйПроект = Неопределено;
		CRM_УправлениеПроектамиВызовСервера.СоздатьПроектПоШаблону(ВыбранноеЗначение, СозданныйПроект);
		Если СозданныйПроект <> Неопределено Тогда
			ПодключитьОбработчикОжидания("ОткрытьСозданныйПроект", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

// +Рабочий стол
#Область Подключаемый_РабочийСтол

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

#КонецОбласти
// -Рабочий стол
