
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_НастройкиПользователяКанБан.АвтообновлениеДоски,
		|	cbr_НастройкиПользователяКанБан.Акцентирование
		|ИЗ
		|	РегистрСведений.cbr_НастройкиПользователяКанБан КАК cbr_НастройкиПользователяКанБан
		|ГДЕ
		|	cbr_НастройкиПользователяКанБан.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		АвтообновлениеДоски = Выборка.АвтообновлениеДоски;
		Акцентирование =  Выборка.Акцентирование;
	КонецЦикла;
	Если АвтообновлениеДоски = 0 Тогда
		АвтообновлениеДоски = 60;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сохранить(Команда)
	Если АвтообновлениеДоски > 0 Тогда
		СохранитьНаСервере();
		Закрыть();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Автообновление должно быть больше 0");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СохранитьНаСервере()
	Пользователь =  Пользователи.АвторизованныйПользователь();
	РегистрыСведений.cbr_НастройкиПользователяКанБан.ИзменениеНастроекАвтообновление(Пользователь, АвтообновлениеДоски, Акцентирование);

КонецПроцедуры
#КонецОбласти