
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//   Отказ - Булево - передается из параметров стандартного обработчика ПриСозданииНаСервере "как есть".
//   СтандартнаяОбработка - Булево - передается из параметров стандартного обработчика ПриСозданииНаСервере "как есть".
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ИспользуетсяСофтФон = сфпСофтФонПроСервер.сфпИспользоватьСофтФон()
		 И сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпИспользоватьСофтФон");
	
	Если Форма.КонтекстВарианта = Метаданные.Документы.CRM_Телемаркетинг.ПолноеИмя() Тогда
		
		Если ИспользуетсяСофтФон Тогда
			Форма.КлючТекущегоВарианта = "ПоТелемаркетингу";
			Форма.Параметры.КлючВарианта = "ПоТелемаркетингу";
		Иначе
			Форма.КлючТекущегоВарианта = "ПоТелемаркетингуБезСФ";
			Форма.Параметры.КлючВарианта = "ПоТелемаркетингуБезСФ";
		КонецЕсли;
		Форма.ВариантыКонтекста.Очистить();
		Форма.ВариантыКонтекста.Добавить(Форма.КлючТекущегоВарианта);
		
	Иначе
		
		Если ИспользуетсяСофтФон Тогда
			Форма.КлючТекущегоВарианта = "Основной";
			Форма.Параметры.КлючВарианта = "Основной";
		Иначе
			Форма.КлючТекущегоВарианта = "ОсновнойБезСФ";
			Форма.Параметры.КлючВарианта = "ОсновнойБезСФ";
		КонецЕсли;
		Форма.ВариантыКонтекста.Очистить();
		Форма.ВариантыКонтекста.Добавить(Форма.КлючТекущегоВарианта);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти // ПрограммныйИнтерфейс
