#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивЗаписейКалендаря = Новый Массив;
	СтруктураЗаписиКалендаря = Новый Структура("Ссылка, ДеньНачала");
	СтруктураЗаписиКалендаря.Ссылка = ПараметрКоманды;
	СтруктураЗаписиКалендаря.ДеньНачала = Неопределено;
	МассивЗаписейКалендаря.Добавить(СтруктураЗаписиКалендаря);
	
	cbr_КалендарьКлиент.Печать(МассивЗаписейКалендаря, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

#КонецОбласти