////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля команды "Справочники.CRM_ВариантыВиджетов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФорму(
		"Справочник.CRM_ВариантыВиджетов.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////