#Область СобытияФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Элементы.Прогресс.Видимость Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Идет конвертация. Закрывать окно обработки нельзя!'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Конвертировать(Команда)
	МассивСообщений = Неопределено;
	ДлительнаяОперация = КонвертироватьНаСервере();
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		АдресХраненияРезультата = ДлительнаяОперация.АдресРезультата;
		ДлительнаяОперация.Свойство("Сообщения", МассивСообщений);
		ОбработатьРезультатОбработки();
		Элементы.ФормаОтмена.Доступность = Истина;
		Элементы.Прогресс.Видимость = Ложь;
	Иначе
		МодульДлительныеОперацииКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ДлительныеОперацииКлиент");
		ПараметрыОжидания = МодульДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОперацииКонвертации", ЭтотОбъект);
		МодульДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбновлениеСостояния", 1);
	Прогресс = 0;
	Элементы.ФормаКонвертировать.Видимость = Ложь;
	Элементы.ФормаОтмена.Доступность = Ложь;
	Элементы.Прогресс.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(ОшибкиКонвертации.Количество() = 0);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КонвертироватьНаСервере()
	
	СтруктураПараметров = Новый Структура;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки", "CRM_КонвертацияПотенциальныхКлиентовВПартнеров");
	ПараметрыЗадания.Вставить("ИмяМетода", "КонвертироватьПКВФоне");
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", СтруктураПараметров);
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Ложь);

	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";

	МодульДлительныеОперации = ОбщегоНазначения.ОбщийМодуль("ДлительныеОперации");
	ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Выгрузка данных EnterpriseData';
		|en='Export EnterpriseData data'");
	РезультатФоновогоЗадания = МодульДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод,
		 ПараметрыЗадания,
		 ПараметрыВыполнения);
	Возврат РезультатФоновогоЗадания;
	
КонецФункции
	
&НаКлиенте
Процедура ПриЗавершенииОперацииКонвертации(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Конвертация завершена неудачно. Отсутствует результат.'");
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	АдресХраненияРезультата = Результат.АдресРезультата;
	Элементы.Прогресс.Видимость = Ложь;
	Элементы.ФормаОтмена.Доступность = Истина;
	ОбработатьРезультатОбработки();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСостояния()
	
	ТекущееЗначение = Прогресс;
	Если ПолучитьСостояниеФоновогоЗадания(ТекущееЗначение) Тогда
		ОтключитьОбработчикОжидания("ОбновлениеСостояния");
		Прогресс = 100;
		Элементы.Прогресс.Видимость = Ложь;
		//Элементы.ФормаКонвертировать.Доступность = Истина;
	Иначе
		Прогресс = ТекущееЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатОбработки()
	
	ОбработатьРезультатОбработкиНаСервере();
	Если ОшибкиКонвертации.Количество() = 0 Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатОбработкиНаСервере()
	
	Ошибки = ПолучитьИзВременногоХранилища(АдресХраненияРезультата);
	Если Ошибки.Количество() > 0 Тогда 
		ЗначениеВРеквизитФормы(Ошибки, "ОшибкиКонвертации");
		Элементы.ОшибкиКонвертации.Видимость = Истина;
		Элементы.ФормаКонвертировать.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСостояниеФоновогоЗадания(ТекущееЗначение)
	Если ИдентификаторЗадания <> Неопределено Тогда
		ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		СтруктураПрогресса = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
		Если ТипЗнч(СтруктураПрогресса) = Тип("Структура") И СтруктураПрогресса.Свойство("Процент", ТекущееЗначение) Тогда
			
		КонецЕсли;
		Если ФЗ.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
			Если ФЗ.Состояние <> СостояниеФоновогоЗадания.Активно
				И ФЗ.Состояние <> СостояниеФоновогоЗадания.Завершено Тогда
				// ошибка выполнения
				ИнформацияОбОшибке = ФЗ.ИнформацияОбОшибке.Описание;
			КонецЕсли;
		КонецЕсли;
		Возврат ФЗ.Состояние <> СостояниеФоновогоЗадания.Активно;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти
