#Область ПрограммныйИнтерфейс

// Записывает операцию бизнес статистики.
//
// Параметры:
//  ИмяОперации	- Строка	- имя операции статистики, в случае отсутствия создается новое.
//  Значение	- Число		- количественное значение операции статистики.
//  Комментарий	- Строка	- произвольный комментарий.
//  Разделитель	- Строка	- разделитель значений в ИмяОперации, если разделитель не точка.
//
Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение = 1, Комментарий = Неопределено,
	Разделитель = ".") Экспорт
	
	CRM_ЦентрМониторингаВызовСервера.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение);
	
КонецПроцедуры

// Функция возвращает массив имен операций бизнес-статистики с аналитикой по роли и пользователю.
// 
// Возвращаемое значение:
//   - Массив
//
Функция ИменаОперацийСАналитикойПоРолиИПользователю() Экспорт
	
	ИменаОпераций = Новый Массив;
	ИменаОпераций.Добавить("CRM_Статистика.Взамодействия.ТелефонныйЗвонок.ДлительностьЗвонка");
	
	Возврат ИменаОпераций;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
