
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивОбъектов", ПараметрКоманды);
	ПараметрыФормы.Вставить("Действие", ПредопределенноеЗначение("Перечисление.гбДействияХранилища.ЗахватитьВХранилище"));
	ОткрытьФорму("Справочник.гбХранилищаБлокСхем.Форма.ДействияСоСпискомОбъектов", 
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
