
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.СозданиеЭлектронногоПисьма.Удобство.КоличествоВыбораРеквизитаТег.КоличествоОткрытияФормыТегов");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.СозданиеЭлектронногоПисьма.Удобство.КоличествоВыбораРеквизитаТег.КоличествоВыбораКнопкиВыбрать");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.СозданиеЭлектронногоПисьма.Удобство.КоличествоВыбораРеквизитаТег.КоличествоВыбораКнопкиСоздать");
	
КонецПроцедуры

#КонецОбласти
