
#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравилаОбработки = Константы.сфпНастройкиТелефонии_ПравилаОбработки.Получить().Получить();
	Если ПравилаОбработки <> Неопределено Тогда
		ЗначениеВРеквизитФормы(ПравилаОбработки, "Телефония_ПравилаОбработки");
	КонецЕсли;
	
	ИзменитьПараметрыВыбораПравилаОбработки();
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПравилаОбработкиТелефонияПриИзменении(Элемент)
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	Если Телефония_ПравилаОбработки.Количество() = 0 Тогда
		CRM_ОбрабатыватьОбращения = Ложь;
		Константы.сфпНастройкиТелефонии_ПрименитьПравилаОбработки.Установить(CRM_ОбрабатыватьОбращения);
	КонецЕсли;
	Константы.сфпНастройкиТелефонии_ПравилаОбработки.Установить(Новый ХранилищеЗначения(РеквизитФормыВЗначение("Телефония_ПравилаОбработки")));
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыВыбораПравилаОбработки()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.CRM_ВариантыОбработкиОбращения.НеОбрабатывать);
	Список.Добавить(Перечисления.CRM_ВариантыОбработкиОбращения.ОтклонитьОбращение);
	
	НовыйМассив = Новый Массив();
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВариантОбработки", Список);
	НовыйМассив.Добавить(ПараметрВыбора);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.CRM_ПравилаОбработкиТелефонияПравилоОбработки.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
