
#Область ПрограммныйИнтерфейс

// Процедура выполняет заполненеие предопределенных внешних библиотек.
//
Процедура ЗаполнитьПредопределенныеВнешниеБиблиотеки() Экспорт
	
	ОбъектСправочника = Справочники.CRM_ВнешниеБиблиотеки.БиблиотекаОтображенияГрафиков.ПолучитьОбъект();
	ОбъектСправочника.НаименованиеМакетаВерсии	= "БиблиотекаОтображенияГрафиков";
	ОбъектСправочника.БиблиотекаСовместимости	= Справочники.CRM_ВнешниеБиблиотеки.БиблиотекаОтображенияГрафиковLinux;
	ОбъектСправочника.Записать();
	
	ОбъектСправочника = Справочники.CRM_ВнешниеБиблиотеки.БиблиотекаОтображенияГрафиковLinux.ПолучитьОбъект();
	ОбъектСправочника.НаименованиеМакетаВерсии	= "БиблиотекаОтображенияГрафиковСовместимость";
	ОбъектСправочника.Записать();
	
КонецПроцедуры // ЗаполнитьПредопределенныеВнешниеБиблиотеки()

#КонецОбласти