#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда
		Автор = Пользователи.АвторизованныйПользователь();
		Если ДанныеЗаполнения <> Неопределено И ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			Сотрудник = ДанныеЗаполнения.Сотрудник;
		КонецЕсли;
		ТипЗаписиКалендаря = Перечисления.cbr_ТипЗаписиКалендаря.ПустоеЗначение;
		Состояние = Перечисления.cbr_СостояниеЗаписиРабочегоКалендаря.Запланированна;
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Предмет") И ТипЗнч(ДанныеЗаполнения.Предмет) = Тип("ДокументСсылка.cbr_Задача") Тогда
			ТипЗаписиКалендаря = Перечисления.cbr_ТипЗаписиКалендаря.Задача;
			Предмет = ДанныеЗаполнения.Предмет;
			Описание = ДанныеЗаполнения.Описание;
			Сотрудник = ДанныеЗаполнения.Сотрудник;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	cbr_КаленарьКлиентСервер.СкорректироватьДатуНачалаИОкончания(ДатаНачала, ДатаОкончания, ВесьДень);

КонецПроцедуры
#КонецОбласти
#КонецЕсли