
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КартаМаршрута = ПараметрКоманды;
	
	Если НЕ ЗначениеЗаполнено(КартаМаршрута) Тогда
		Если СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "ФормаСписка") = 0 Тогда
			ПоказатьПредупреждение(, Нстр("ru='Карта маршрута не записана."
			"Настройка этапов недоступна!';en='Route map not written."
			"Setting of stages is not available!'"));
		КонецЕсли;
		Возврат;
	Иначе
		Если СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "ФормаЭлемента") > 0
			И ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
			ПоказатьПредупреждение(, Нстр("ru='Карта маршрута не записана."
			"Настройка этапов недоступна!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если КартаМаршрутаЭтоГруппа(КартаМаршрута) Тогда
		Возврат;
	КонецЕсли;
	
	Если  КартаМаршрутаРедактируется(КартаМаршрута) Тогда
		ПоказатьПредупреждение(, Нстр("ru='Карта маршрута находится в процессе редактирования."
"Настройка этапов недоступна!'"));
		Возврат;
	КонецЕсли;		
	
	ПараметрыФормы = Новый Структура("Процесс", ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма.CRM_НастройкаЭтаповБизнесПроцессов", ПараметрыФормы,
		 ПараметрыВыполненияКоманды.Источник,
		 ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КартаМаршрутаРедактируется(КартаМаршрута)
	Возврат (КартаМаршрута.Редактируется);
КонецФункции

&НаСервере
Функция КартаМаршрутаЭтоГруппа(КартаМаршрута)
	Возврат (КартаМаршрута.ЭтоГруппа);
КонецФункции

#КонецОбласти
