
Перем ФормаПроверкиОбновления Экспорт;


&После("ПриНачалеРаботыСистемы")
Процедура гбПриНачалеРаботыСистемы()
	
	Если гбСерверПовтИсп.РольДоступнаПользователю("гбИспользование") тогда
		гбКлиент.ПодключитьОбработчикиСообщенийСистемыВзаимодействия();	
	КонецЕсли;
	Если гбСерверПовтИсп.ПравоДоступноПользователю("Просмотр", "ОбщиеФормы.гбПроверкаОбновлений") тогда
		ОткрытьФорму("ОбщаяФорма.гбПроверкаОбновлений", Новый Структура("ПроверкаОбновленияПриНачалеРаботыСистемы", Истина));
	КонецЕсли;
		
КонецПроцедуры

