
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(ТипЭлемента) или ЭтоГруппа тогда
		Если ПустаяСтрока(Код) тогда
			Код = Новый УникальныйИдентификатор;
		КонецЕсли;
	Иначе
		Наименование = Код;
	КонецЕсли;

	гбХранилище.БлокСхемаИлиАлгоритмПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если не ЗначениеЗаполнено(ТипЭлемента) и не ЭтоГруппа тогда
		Попытка
			Структура = Новый Структура;
			Структура.Вставить(Код);
		Исключение                 
			гбКлиентСервер.СообщитьПользователю(
				"Недопустимый код (код должен отвечать требованиям, предъявляемым к именам переменных)", ЭтотОбъект, "Код", , Отказ);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если ЗначениеЗаполнено(ОбъектКопирования.ТипЭлемента) тогда
		Код = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

