#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьЗавершённыеПроекты = (CRM_ХранилищеНастроек.Загрузить("ПоказыватьЗавершённыеПроекты") = Истина);
	
	Элементы.ФормаПоказыватьЗавершённыеПроекты.Пометка = ПоказыватьЗавершённыеПроекты;
	
	Если ПоказыватьЗавершённыеПроекты Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Завершен");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Завершен",
			Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьЗавершённыеПроекты(Команда)
	
	ПоказыватьЗавершённыеПроекты = Не ПоказыватьЗавершённыеПроекты;
	
	Элементы.ФормаПоказыватьЗавершённыеПроекты.Пометка = ПоказыватьЗавершённыеПроекты;
	
	CRM_ХранилищеНастроек.Сохранить("ПоказыватьЗавершённыеПроекты", "", ПоказыватьЗавершённыеПроекты);
	
	Если ПоказыватьЗавершённыеПроекты Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Завершен");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Завершен",
			Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
