
#Область СлужебныйПрограммныйИнтерфейс

// Проверяет наличие в контактных лицах партнера-организации
// текущего руководителя по данным сервиса 1С-Контрагент
//
// Параметры:
//  РеквизитыКонтрагента - Структура - данные, полученные от сервиса;
//
Функция СравнитьДанныеРуководителя(РеквизитыКонтрагента) Экспорт
	
	Если РеквизитыКонтрагента.Свойство("Руководитель")
		И РеквизитыКонтрагента.Руководитель <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.CRM_Фамилия КАК CRM_Фамилия,
		|	КонтактныеЛицаПартнеров.CRM_Имя КАК CRM_Имя
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Владелец.Наименование = &Наименование
		|	И КонтактныеЛицаПартнеров.CRM_Фамилия = &CRM_Фамилия
		|	И КонтактныеЛицаПартнеров.CRM_Имя = &CRM_Имя";
		
		Запрос.УстановитьПараметр("Наименование", РеквизитыКонтрагента.Наименование);
		Запрос.УстановитьПараметр("CRM_Фамилия", РеквизитыКонтрагента.Руководитель.Фамилия);
		Запрос.УстановитьПараметр("CRM_Имя", РеквизитыКонтрагента.Руководитель.Имя);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
