////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля объекта "Справочники.CRM_ШаблоныКлючевыхПоказателей".
//
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		Виджет = Справочники.CRM_Виджеты.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////