
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Задача", Задача) Тогда
		СписокПользователей = cbr_ОбработчикиФормыЗадачиСервер.ПользователиВыбраннойЗадачи(Задача);
		
		Для Каждого Пользователь Из СписокПользователей Цикл
			СтрокаТаблицы = Пользователи.Добавить();
			СтрокаТаблицы.Пользователь = Пользователь;
		КонецЦикла;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсех(Команда)
	Для Каждого СтрокаТаблицы Из Пользователи Цикл
		СтрокаТаблицы.ИндикаторВыбора = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор(Команда)
	Для Каждого СтрокаТаблицы Из Пользователи Цикл
		СтрокаТаблицы.ИндикаторВыбора = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Уведомить(Команда)
	УведомитьНаСервере();
	
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УведомитьНаСервере()
	ТекстНапоминания = СтрШаблон("Задача требует внимания");
	ТекущаяДата = ТекущаяДатаСеанса();
	ПериодичностьНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.Периодически;
	
	Для Каждого СтрокаТаблицы Из Пользователи Цикл
		Если СтрокаТаблицы.ИндикаторВыбора Тогда
			cbr_УведомленияПользователей.ОтправитьУведомлениеПользователю(СтрокаТаблицы.Пользователь, ТекстНапоминания,
					ТекущаяДата, ТекущаяДата, ПериодичностьНапоминания, 60, Задача, , Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	
#КонецОбласти