
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		
		Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
			CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.Взаимодействия.ЭлектронноеПисьмоВходящее.Удобство.КоличествоНажатийКнопкаСтруктураПодчиненностиДокумента");
		ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
			CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.Взаимодействия.ЭлектронноеПисьмоОтправленное.Удобство.КоличествоНажатийКнопкаСтруктураПодчиненностиДокумента");
		КонецЕсли;
		ОткрытьФорму("ОбщаяФорма.CRM_СтруктураПодчиненности", Новый Структура("ОбъектОтбора", ПараметрКоманды),
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Источник.КлючУникальности,
				ПараметрыВыполненияКоманды.Окно);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
