
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодразделения = CRM_ОбщегоНазначенияПовтИсп.ИспользоватьПодразделения();
	
	ВидНастроек = ?(ИспользоватьПодразделения, 0, 1);
	Элементы.ВидНастроек.Видимость = ИспользоватьПодразделения;Элементы.ВидНастроек.Видимость = ИспользоватьПодразделения;
	
	Если ЗначениеЗаполнено(Запись.Объект) Тогда
		Если ТипЗнч(Запись.Объект) = Тип("Строка") Тогда
			ВидНастроек = 0;
		ИначеЕсли ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.Пользователи") Тогда
			Пользователь = Запись.Объект;
			ВидНастроек = 1;
		ИначеЕсли ИспользоватьПодразделения Тогда
			Подразделение = Запись.Объект;
			ВидНастроек = 2;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеВидимостью();
	Элементы.ИмяФормы.СписокВыбора.ЗагрузитьЗначения(CRM_РабочийСтолСервер.ПолучитьСписокДоступныхФорм().ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ВидНастроек = 0 Тогда
		ТекущийОбъект.Объект = "Общие настройки";
	ИначеЕсли ВидНастроек = 1 Тогда
		ТекущийОбъект.Объект = Пользователь;
	Иначе
		ТекущийОбъект.Объект = Подразделение;
	КонецЕсли;
	ТекущийОбъект.Идентификатор = Новый УникальныйИдентификатор;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНастроекПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостью()
	Если ВидНастроек = 0 Тогда
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Ложь;
	ИначеЕсли ВидНастроек = 1 Тогда
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Истина;
	Иначе
		Элементы.Подразделение.Видимость = Истина;
		Элементы.Пользователь.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти
