
#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеАвторизацииЗаполнены(СервисКалендарей, ДанныеАвторизации) Экспорт
	
	Если СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.Google") Тогда
		Возврат Не CRM_ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(ДанныеАвторизации);
	ИначеЕсли СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.Яндекс") 
		Или СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.MailRu") 
		Или СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.iCloud") Тогда
		Возврат CRM_ОбменСВнешнимиКалендарямиВызовСервера.ДанныеАвторизацииЗаполнены(ДанныеАвторизации);
	Иначе
		Возврат CRM_СинхронизацияКалендарейКлиентСерверПереопределяемый.ДанныеАвторизацииЗаполнены(СервисКалендарей,
			 ДанныеАвторизации);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
