#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяСтрока = Параметры.ТекущаяСтрока;
	
	
	гбХранилище.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПослеОткрытия", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия()
	Элементы.Список.ТекущаяСтрока = ?(ЗначениеЗаполнено(ТекущаяСтрока), ТекущаяСтрока, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбработкаОповещенияНаСервере(ИмяСобытия);
	гбХранилищеКлиент.ОбработкаОповещения_ФормаСписка(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия)
	гбХранилище.ОбработкаОповещения_ФормаСписка(ЭтаФорма, ИмяСобытия);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьЗначение(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Справочник.гбАлгоритмы.ПустаяСсылка"));
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	гбХранилищеКлиент.СписокПриАктивизацииСтроки(ЭтаФорма, Элемент);	
КонецПроцедуры


#КонецОбласти


