
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.ПутьКлиента.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("CRM_КонтекстВызова", "РазделКлиенты");
	ОткрытьФорму("Отчет.CRM_ПутьКлиента.Форма", ПараметрыОтчета, ПараметрыВыполненияКоманды.Источник,
		 ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
