
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокВходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Элемент.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СписокИсходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Элемент.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВходящие(Команда)
	ОповеститьОВыборе(Элементы.СписокВходящие.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИсходящие(Команда)
	ОповеститьОВыборе(Элементы.СписокИсходящие.ВыделенныеСтроки);
КонецПроцедуры

#КонецОбласти
