
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Телемаркетинг", ПараметрКоманды);
	
	СтруктураСобытия = Новый Структура("ПриСозданииНаСервере", Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("События", СтруктураСобытия);
	Если СофтФонИспользуется() Тогда
		ПараметрыФормы.Вставить("КлючВарианта", "ПоТелемаркетингу");
	Иначе
		ПараметрыФормы.Вставить("КлючВарианта", "ПоТелемаркетингуБезСФ");
	КонецЕсли;
	ПараметрыФормы.Вставить("Отбор", ПараметрыДанных);
	
	ОткрытьФорму("Отчет.CRM_АнализТелемаркетингаПоЗвонкамИИнтересам.Форма", ПараметрыФормы,
		 ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		 ПараметрыВыполненияКоманды.Окно,
		 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СофтФонИспользуется()
	Возврат сфпСофтФонПроСервер.сфпИспользоватьСофтФон()
		 И сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпИспользоватьСофтФон");
КонецФункции

#КонецОбласти
