
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.Взаимодействия.ЭлектронноеПисьмоВходящее.Удобство.КоличествоНажатийКнопкаЗапуститьОстановитьСчетчикВремени");
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.Взаимодействия.ЭлектронноеПисьмоОтправленное.Удобство.КоличествоНажатийКнопкаЗапуститьОстановитьСчетчикВремени");
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВыполненияКоманды.Источник, "УРВ_ВидРабот") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно запустить счетчик рабочего времени из этой формы.'"));
		Возврат;
	КонецЕсли;
	
	CRM_ТрудозатратыСервер.ТаймерУРВНажатиеНаСервере(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник["УРВ_ВидРабот"]);
	Оповестить(CRM_ТрудозатратыКлиент.ИмяСобытияИзмененияСостоянияТаймера(), "Нажатие",
		 ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

#КонецОбласти
