////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля формы "Справочники.CRM_ВариантыВиджетов.Форма.ФормаВыбора".
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантРаботыВиджетов") Тогда
		
		ВариантРаботыВиджетов = Параметры.ВариантРаботыВиджетов;
		
		// Список.Используется.
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "Используется", Истина, ВидСравненияКомпоновкиДанных.Равно);
		
		// Список.ГруппиИЛИ
		ГруппировкаЭлементовОтбора = CRM_ОбщегоНазначенияКлиентСервер.УстановитьГруппуОтбораСписка(
			Список, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		// Список.ГруппиИЛИ.Автор
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "Автор", Пользователи.ТекущийПользователь(), ВидСравненияКомпоновкиДанных.Равно, ГруппировкаЭлементовОтбора);
		
		// Список.ГруппиИЛИ.ТолькоДляАвтора
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "ТолькоДляАвтора", Ложь, ВидСравненияКомпоновкиДанных.Равно, ГруппировкаЭлементовОтбора);
		
		Если Параметры.Свойство("ИсключаемыеВариантыВиджетов") Тогда
			
			// Список.Ссылка
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
				Список, "Ссылка", Параметры.ИсключаемыеВариантыВиджетов, ВидСравненияКомпоновкиДанных.НеВСписке);
			
		КонецЕсли;
		
		Если ВариантРаботыВиджетов = "РабочийСтол" Тогда
			
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
				Список,
				"Ссылка.Виджет.ТипИсточникаДанных",
				Перечисления.CRM_ТипыИсточниковДанныхВиджетов.КлючевойПоказатель,
				ВидСравненияКомпоновкиДанных.Равно);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////