#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПереходНаНовуюВерсию

Процедура ЗаполнитьДанныеПриПереходеНаВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 5000
	                      |	CRM_Интерес.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.CRM_Интерес КАК CRM_Интерес
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыАРМ_Поддержка КАК CRM_ОбъектыАРМ_Поддержка
	                      |		ПО (CRM_ОбъектыАРМ_Поддержка.Обращение = CRM_Интерес.Ссылка)
	                      |ГДЕ
	                      |	CRM_Интерес.ЭтоПоддержка
	                      |	И CRM_ОбъектыАРМ_Поддержка.Обращение ЕСТЬ NULL
	                      |	И НЕ CRM_Интерес.ПометкаУдаления
	                      | И CRM_Интерес.ТипОбращения <> ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.Интерес)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_Интерес.Дата УБЫВ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		CRM_РаботаАРМСервер.CRM_ЗаполнениеАРМПоддержка(Выборка.Ссылка, Ложь);
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка); 
	КонецЦикла;
	
	Выборка.Сбросить();
	
	Если Выборка.Следующий() Тогда
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка); 
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = (Выборка.Количество() < 5000);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#КонецЕсли