
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура - обработчик события "ОбработкаКоманды".
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
			"CRM_Статистика.Взаимодействия.ЭлектронноеПисьмоВходящее.Удобство.КоличествоНажатийКнопкаНапомнить");
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
			"CRM_Статистика.Взаимодействия.ЭлектронноеПисьмоОтправленное.Удобство.КоличествоНажатийКнопкаНапомнить");
	КонецЕсли;
	СекундВСутках = 86400;
	ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	CRM_НапоминанияСервер.ДобавитьНапоминание(ПараметрКоманды, ПараметрКоманды, , 
		ДатаСеанса + СекундВСутках, Истина); 
	Состояние(НСтр("ru='Напоминание добавлено';en='Reminder added'"));
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти
