#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭтоCRM 		  = CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM();
	ЭтоCRMБазовая = ЭтоCRM И СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	ЭтоУТиВСК	  = CRM_ОбщегоНазначенияПовтИсп.ЭтоУТиВСК();
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если Параметры.СтрокаПоиска = "" Тогда
		Если ЭтоCRMБазовая Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.БАЗОВАЯ);
		Иначе
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАРТ);
				ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАНДАРТ);
			КонецЕсли;
			
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM()
			 Или CRM_ОбщегоНазначенияПовтИсп.ЭтоУТиВСК() Тогда
				ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
			КонецЕсли;

			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.КОРП);
		КонецЕсли;
	Иначе
		Если ЭтоCRMБазовая Тогда
			Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.БАЗОВАЯ), ВРег(Параметры.СтрокаПоиска)) > 0 Тогда
				ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.БАЗОВАЯ);
			КонецЕсли;
		Иначе
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.СТАРТ), ВРег(Параметры.СтрокаПоиска)) > 0 Тогда
					ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАРТ);
				КонецЕсли;
				Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.СТАНДАРТ), ВРег(Параметры.СтрокаПоиска)) > 0 Тогда
					ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАНДАРТ);
				КонецЕсли;
			КонецЕсли;
			
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM()
			 Или CRM_ОбщегоНазначенияПовтИсп.ЭтоУТиВСК() Тогда
				Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.ПРОФ), ВРег(Параметры.СтрокаПоиска)) > 0 Тогда
					ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
				КонецЕсли;
			КонецЕсли;
			
			Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.КОРП), ВРег(Параметры.СтрокаПоиска)) > 0 Тогда
				ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.КОРП);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
