#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Создать запись в регистр сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Событие - Строка.
Процедура ЗаписатьСобытие(Задача, Событие, Пользователь = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.АвторСобытия = Пользователь;
	МенеджерЗаписи.Период = МенеджерЗаписи.Дата;
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.Записать();
КонецПроцедуры

// Создать набор записей в регистр сведений
// Параметры:
//  События - Массив Из Структура:
//		* Задача - ДокументСсылка.cbr_Задача
//		* Событие -  Строка.
Процедура ЗаписатьНаборСобытий(События, Пользователь = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого Событие Из События Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Дата = ТекущаяДатаСеанса();
		Запись.Задача = Событие.Задача;
		Запись.АвторСобытия = Пользователь;
		Запись.Период = Запись.Дата;
		Запись.Событие = Событие.Событие;
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
КонецПроцедуры
#КонецОбласти
#КонецЕсли