
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Администрирование", Метаданные) Тогда
		// удалим гиперссылку из заголовка
		Элементы.ДекорацияСпособОтправкиСМС.Заголовок = Строка(Элементы.ДекорацияСпособОтправкиСМС.Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияНастройкаПодключенияСМС".
//
Процедура НастройкаПодключенияСМС()
	ФормаНастроек = ПолучитьФорму("ОбщаяФорма.НастройкаОтправкиSMS");
	Если ФормаНастроек.Открыта() Тогда
		ФормаНастроек.Активизировать();
	Иначе
		ФормаНастроек.Открыть();
	КонецЕсли;
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.SMS.ВыводОкнаСМСНеНастроены");
КонецПроцедуры // ДекорацияНастройкаПодключенияСМС()

&НаКлиенте
Процедура ДекорацияПодробнаяИнформацияСМСНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://1crm.ru/help/kanaly-kommunikatsii/");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСпособОтправкиСМСОбработкаНавигационнойСсылки(Элемент,
	 НавигационнаяСсылкаФорматированнойСтроки,
	 СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НастройкаПодключенияСМС();
КонецПроцедуры

#КонецОбласти
