
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Показатели.ОтчетыПоПоказателям.КоличествоОткрытийОтчетСводныйАнализПоказателей");
	
	ПараметрыОткрытия = Новый Структура("Отчет, ТипОтчета, ИмяОтчета, КлючВарианта");
	
	ПараметрыОткрытия.ТипОтчета = "Внутренний";
	ПараметрыОткрытия.ИмяОтчета = "CRM_АнализАктивныхПоказателей";
	ПараметрыОткрытия.КлючВарианта = "СводныйАнализПоказателей";
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Неопределено, ПараметрыОткрытия, Новый Структура);
	
КонецПроцедуры

#КонецОбласти
