
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сценарий") И Параметры.Свойство("ТипОбращения") Тогда
		
		Если ЗначениеЗаполнено(Параметры.Сценарий) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("Сценарий", Параметры.Сценарий);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ТипОбращения) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ТипОбращения", Параметры.ТипОбращения);
		КонецЕсли;
		
		Если Параметры.Свойство("ИсключаемыеПричины") Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ИсключаемыеПричины", Параметры.ИсключаемыеПричины);
		КонецЕсли;
		
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|СправочникCRM_ПричиныОтказаПоИнтересам.Ссылка КАК Ссылка,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ПометкаУдаления КАК ПометкаУдаления,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Родитель КАК Родитель,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ЭтоГруппа КАК ЭтоГруппа,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Код КАК Код,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Наименование КАК Наименование,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ТипОбращения КАК ТипОбращения,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Сценарий КАК Сценарий,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ОтображатьПоУмолчанию КАК ОтображатьПоУмолчанию,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Предопределенный КАК Предопределенный,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ВерсияДанных КАК ВерсияДанных
		|ИЗ
		|Справочник.CRM_ПричиныОтказаПоИнтересам КАК СправочникCRM_ПричиныОтказаПоИнтересам";
	
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
