
&НаСервере
Процедура ПолучитьПапкуНаСервере()
	URL = "https://c1c.bitrix24.ru/rest/3097/ztlcnlwwa060a57v/";
	Результат = OPI_Bitrix24.ПолучитьПользователя(URL, 3089);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПапку(Команда)
	ПолучитьПапкуНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОтправитьВопросНаСервере()
	
	cbr_Битрикс24.СоздатьКомментарийКЗадачеИзВопроса(Задача);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВопрос(Команда)
	ОтправитьВопросНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗадачуНаСервере()
	
	Ответ = cbr_Битрикс24.ПолучитьЗадачуИзБитрикса(Задача);
	ДанныеЗадачи = Ответ["result"]["task"];
	
	URL = "https://c1c.bitrix24.ru/rest/3097/ztlcnlwwa060a57v/";
	Токен = "";
	
	ЧекЛистЗадачиБитрикс = ДанныеЗадачи["checklist"];
	
	Для Каждого Элемент Из ЧекЛистЗадачиБитрикс Цикл
		
		Если Элемент.Значение["sortIndex"] = "0" Тогда
			
			АйДиЭлемента = Элемент.Значение["id"];
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = OPI_Bitrix24.УдалитьЭлементЧеклистаЗадачи(URL, ДанныеЗадачи["id"], АйДиЭлемента, Токен);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗадачу(Команда)
	ПолучитьЗадачуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКаталогВХранилищеНаСервере()
	
	URL = "https://c1c.bitrix24.ru/rest/3097/ztlcnlwwa060a57v/";
	Результат = OPI_Bitrix24.СоздатьКаталогВХранилище(URL, 3943, "TasksFiles");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКаталогВХранилище(Команда)
	ДобавитьКаталогВХранилищеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПоляХранилищаНаСервере()
	
	Результат = cbr_Битрикс24.ПолучитьСписокПолейХранилища();
	

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПоляХранилища(Команда)
	ПолучитьПоляХранилищаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ХранилищеПоНомеруНаСервере()

//	URL = "https://c1c.bitrix24.ru/rest/3097/ztlcnlwwa060a57v/";
URL = "https://c1c.bitrix24.ru/rest/3089/k6jllepat6a3ly3n/";
	Результат = OPI_Bitrix24.ПолучитьХранилище(URL, НомерХранилища);

КонецПроцедуры

&НаКлиенте
Процедура ХранилищеПоНомеру(Команда)
	ХранилищеПоНомеруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеЗадачиНаСервере()
	
//	URL = "https://c1c.bitrix24.ru/rest/3089/hxjd2525sutx3574/";
//	URL = "https://c1c.bitrix24.ru/rest/3097/ztlcnlwwa060a57v/"; // Это инфо
//	URL = "https://c1c.bitrix24.ru/rest/1/81fi28rujj8l5yt4/"; //Это Антон
	
//	Токен = "81fi28rujj8l5yt4";
//	Результат = OPI_Bitrix24.ПолучитьХранилище(URL, НомерХранилища);
//	Результат = OPI_Bitrix24.ПолучитьХранилищеПриложения(URL);
//	Результат = OPI_Bitrix24.ПолучитьСписокХранилищ(URL);
//	Для Каждого элемент Из Результат["result"] Цикл
//		Сообщить(Элемент["NAME"])
//	КонецЦикла;
//	Сообщить(Результат["result"]["NAME"]);

	Результат = cbr_Битрикс24.ПолучитьСписокХранилищ();
	
	Сообщить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеЗадачи(Команда)
	ПолучитьДанныеЗадачиНаСервере();
КонецПроцедуры

//&НаСервере
//Процедура ПолучитьДанныеЗадачиНаСервере()
//	URL = "https://c1c.bitrix24.ru/rest/3089/hxjd2525sutx3574/";
//	ЗадачаНомер = 35027;
//	Ответ = OPI_Bitrix24.ПолучитьЗадачу(URL, ЗадачаНомер);
//	
//	Ответ2 = OPI_Bitrix24.ДобавитьЭлементЧеклистаЗадачи(URL, ЗадачаНомер, "Первое что написал");
//	Ответ3 = OPI_Bitrix24.ДобавитьЭлементЧеклистаЗадачи(URL, ЗадачаНомер, "Второе что написал");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПолучитьДанныеЗадачи(Команда)
//	ПолучитьДанныеЗадачиНаСервере();
//КонецПроцедуры

&НаСервере
Процедура ПоляЗадачиНаСервере()
	URL = "https://c1c.bitrix24.ru/rest/3089/hxjd2525sutx3574/";
	Ответ = OPI_Bitrix24.ПолучитьСписокПользовательскихПолейЗадачи(URL);
КонецПроцедуры

&НаКлиенте
Процедура ПоляЗадачи(Команда)
	ПоляЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	cbr_Битрикс24.УдалитьЗадачуВБитриксе(Задача);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПыщНаСервере()

  //  ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();
  //  Час         = 3600;
  //  Сутки       = 24;
  //  Исполнитель = 1;
  //
  //    СтруктураЗадачи = Новый Структура;
  //    СтруктураЗадачи.Вставить("TITLE"         , "Новая задача");
  //    СтруктураЗадачи.Вставить("DESCRIPTION"   , "Новое описание задачи");
  //    СтруктураЗадачи.Вставить("PRIORITY"      , "2");
  //    СтруктураЗадачи.Вставить("DEADLINE"      , ТекущаяДата + Час * Сутки);
  //    СтруктураЗадачи.Вставить("RESPONSIBLE_ID", Исполнитель);
  //    
  //    URL = "https://c1c.bitrix24.ru/rest/3089/hxjd2525sutx3574/";
  //    
  //    Результат = OPI_Bitrix24.СоздатьЗадачу(URL, СтруктураЗадачи);
  
//  	СтруктураЗадачи = Новый Структура;
//    СтруктураЗадачи.Вставить("TITLE"      , "Другой заголовок задачи");
//    СтруктураЗадачи.Вставить("DESCRIPTION", "Проверка изменения задачи");
//    СтруктураЗадачи.Вставить("PRIORITY"   , "1");
//
//    URL = "https://c1c.bitrix24.ru/rest/3089/hxjd2525sutx3574/";
//	
//	Результат = cbr_Битрикс24.ПолучитьДанныеЗадачи(Задача);
//	cbr_Битрикс24.ПереработатьДанныеСтруктуры(Результат);
//	Результат3 = cbr_Битрикс24.ЗаменитьКлючиВСтруктуреЗадачи(Результат);
	
//	РезультатЗадачи = OPI_Bitrix24.СоздатьЗадачу(URL, Результат);
	
	cbr_Битрикс24.ОтправитьЗадачуВБитрикс(Задача);
КонецПроцедуры

&НаКлиенте
Процедура Пыщ(Команда)
	ПыщНаСервере();
КонецПроцедуры
