#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура ЗаписатьСтатусЗадачи(Задача, Статус, Период, Пользователь = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Период;
		МенеджерЗаписи.Задача = Задача;
		МенеджерЗаписи.Статус = Статус;
		МенеджерЗаписи.Записать();
		
		РегистрыСведений.cbr_СобытияПоЗадачам.ЗаписатьСобытие(Задача, СтрШаблон("Установлен статус %1", Статус),
			Пользователь);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры
#КонецОбласти
#КонецЕсли