
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") И НЕ Параметры.Основание = Неопределено Тогда
		Если ТипЗнч(Параметры.Основание) = Тип("СправочникСсылка.Проекты") Тогда
			ДляПроекта = Истина;
			//ИмяОбъекта = Метаданные.Документы.УдалитьCRM_Событие.Имя;
			ИмяОбъекта = Параметры.Основание.Метаданные().Имя;
		Иначе
			ИмяОбъекта = Параметры.Основание.Метаданные().Имя;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИмяОбъекта", ИмяОбъекта,
			 ВидСравненияКомпоновкиДанных.Равно, ,
			 Истина);
	КонецЕсли;
	
	ПоказатьПодсказку = CRM_ХранилищеНастроек.Загрузить(ЭтотОбъект.ИмяФормы, "ПоказыватьПодсказкуШаблоныДокументов");
	Элементы.Описание.Видимость = ?(ПоказатьПодсказку = Неопределено, Истина, ПоказатьПодсказку);
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОписаниеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	CRM_ХранилищеНастроек.Сохранить(ИмяФормы, "ПоказыватьПодсказкуШаблоныДокументов", Ложь);
	Элементы.Описание.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
