
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТолькоПросмотр = (ТекущийПользователь <> Объект.Владелец);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		
		НаборЗаписейКопирования = РегистрыСведений.CRM_СоставыГруппПолучателей.СоздатьНаборЗаписей();
		НаборЗаписейКопирования.Отбор.ГруппаПолучателей.Установить(ЗначениеКопирования);
		НаборЗаписейКопирования.Прочитать();
		
		Если НаборЗаписейКопирования.Количество() > 0 Тогда
			
			НаборЗаписейНовый = РегистрыСведений.CRM_СоставыГруппПолучателей.СоздатьНаборЗаписей();
			НаборЗаписейНовый.Отбор.ГруппаПолучателей.Установить(Объект.Ссылка);
			
			Для Каждого Запись Из НаборЗаписейКопирования Цикл
				НоваяЗапись = НаборЗаписейНовый.Добавить();
				НоваяЗапись.ГруппаПолучателей = Объект.Ссылка;
				НоваяЗапись.Получатель = Запись.Получатель;
			КонецЦикла;
			
			НаборЗаписейНовый.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти