
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ВыбраннаяФорма = "Обработка.CRM_ПланированиеПродаж.Форма.Форма";
	ДанныеОбсуждения = Новый Структура;
	ТекПользователь = Пользователи.ТекущийПользователь();
	Если Параметры.Ключ.ПользовательРуководитель = ТекПользователь Тогда
		ДанныеОбсуждения.Вставить("СобеседникЯвляетсяРуководителем", Ложь);
		ДанныеОбсуждения.Вставить("Собеседник", Параметры.Ключ.ПользовательПодчиненный); 
	Иначе
		ДанныеОбсуждения.Вставить("СобеседникЯвляетсяРуководителем", Истина);
		ДанныеОбсуждения.Вставить("Собеседник", Параметры.Ключ.ПользовательРуководитель); 
	КонецЕсли;
	ДанныеОбсуждения.Вставить("Пользователь", ТекПользователь);  
	ДанныеОбсуждения.Вставить("ПланПродаж", Параметры.Ключ.ПланПродаж);  
	Параметры.Вставить("ДанныеОбсуждения", ДанныеОбсуждения);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#КонецЕсли