
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.Клиенты.УниверсальныйЖурналДокументов.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
	ПараметрыФормы = Новый Структура("ОтборКонтакт,БлокироватьИзменениеОтбораПоКонтакту", ПараметрКоманды, Истина);
	ОткрытьФорму("Обработка.CRM_УниверсальныйЖурналДокументов.Форма.ФормаФиксированныйОтбор",
		 ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		 ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
