////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает бизнес-регион.
//
// Параметры:
//  НомерТелефона	 - Строка	 - Номер телефона.
//  КодСтраны		 - Строка	 - Код страны.
//  КодГорода		 - Строка	 - Код города.
// 
// Возвращаемое значение:
//   - СправочникСсылка.БизнесРегионы
//
Функция ОпределитьБизнесРегион(НомерТелефона, КодСтраны, КодГорода) Экспорт
	
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	Если КодСтраны = "+7" Или КодСтраны = "7" Тогда
		БизнесРегион = сфпСофтФонПроСервер.сфпПолучитьБизнесРегионПоНомеруТелефона(НомерТелефона);
	КонецЕсли;
	
	Если БизнесРегион = Неопределено Тогда
		КодГорода = СтрЗаменить(КодГорода, " ", "");
		КодГородаДляЗапроса = ?(СтрДлина(КодГорода) <> 3, КодГорода, Неопределено);
		БизнесРегион = CRM_УправлениеКонтактнойИнформацией.ОпределитьБизнесРегион(НомерТелефона,
			 КодСтраны,
			 КодГородаДляЗапроса);
	КонецЕсли;
	
	Возврат БизнесРегион;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
