#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = НСтр("ru='Установка показателя';en='Set indicator'") + ": " + Данные.Показатель + "/" 
		+ Данные.Исполнитель;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Показатель");
	Поля.Добавить("Исполнитель");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
