////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля менеджера "Справочники.CRM_ВариантыВиджетов".
//
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Общая функция получения настроек виджета.
//
// Параметры:
//  Виджет  - СправочникСсылка.CRM_Виджет - Виджет.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки(Виджет) Экспорт
	
	Если Виджет.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.КлючевойПоказатель Тогда
		
		Возврат ПолучитьНастройки_КлючевыеПоказатели(Виджет);
		
	ИначеЕсли Виджет.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.ВоронкаПродаж Тогда
		
		Возврат ПолучитьНастройки_ВоронкаПродаж();
		
	ИначеЕсли Виджет.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.ДинамикаПродаж Тогда
		
		Возврат ПолучитьНастройки_ДинамикаПродаж();
		
	ИначеЕсли Виджет.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.ДебиторскаяЗадолженность Тогда
		
		Возврат ПолучитьНастройки_ДебиторскаяЗадолженность();
		
	ИначеЕсли Виджет.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.ДинамикаСтатусовКлиентов Тогда
		
		Возврат ПолучитьНастройки_ДинамикаСтатусовКлиентов();
		
	ИначеЕсли Виджет.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.СтатистикаТелефонныхЗвонков Тогда
		
		Возврат ПолучитьНастройки_СтатистикаТелефонныхЗвонков();
		
	ИначеЕсли Виджет.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.ТрудозатратыВремениПоВидамРабот Тогда
		
		Возврат ПолучитьНастройки_ТрудозатратыВремениПоВидамРабот();
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьНастройки()

// Функция используется для получения пустых настроек виджета ключевых показателей.
//
// Параметры:
//  Виджет  - СправочникСсылка.CRM_Виджет - Виджет ключевого показателя.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки_КлючевыеПоказатели(Виджет = Неопределено) Экспорт
	
	НастройкиВиджета = Новый Структура;
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ОтображатьОбщиеРезультаты", Ложь);
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ОтображатьПлановыеЗначения", Ложь);
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ДинамическоеЗначениеАналитики", Ложь);
	
	// Типы: ПеречислениеСсылка.CRM_ВидыРазверткиПоказателей
	НастройкиВиджета.Вставить("ТипАналитики", Перечисления.CRM_ВидыРазверткиПоказателей.ПоВсейКомпании);
	
	// Типы: СправочникСсылка.СтруктураПредприятия | СправочникСсылка.Пользователи
	НастройкиВиджета.Вставить("ЗначениеАналитики", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	// --------------
	// Переопределяемые
	
	Если Виджет = Справочники.CRM_Виджеты.ВыполнениеПланаПродаж
			Или Виджет = Справочники.CRM_Виджеты.ВыполнениеПланаПродаж Тогда
		
		// Типы: СправочникСсылка.CRM_ПланПродаж
		НастройкиВиджета.Вставить("ПланПродаж", Справочники.CRM_ПланПродаж.ПустаяСсылка());
		
	КонецЕсли;
	
	// --------------
	
	Возврат НастройкиВиджета;
	
КонецФункции // ПолучитьНастройки_КлючевыеПоказатели()

// Функция используется для получения пустых настроек виджета динамики продаж.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки_ДинамикаПродаж() Экспорт
	
	НастройкиВиджета = Новый Структура;
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ДинамическоеЗначениеАналитики", Ложь);
	
	// Типы: ПеречислениеСсылка.CRM_ВидыРазверткиПоказателей
	НастройкиВиджета.Вставить("ТипАналитики", Перечисления.CRM_ВидыРазверткиПоказателей.ПоВсейКомпании);
	
	// Типы: СправочникСсылка.СтруктураПредприятия | СправочникСсылка.Пользователи
	НастройкиВиджета.Вставить("ЗначениеАналитики", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	// Типы: СтандартныйПериод
	НастройкиВиджета.Вставить("СтандартныйПериод", Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	
	// Типы: ПеречислениеСсылка.Периодичность
	НастройкиВиджета.Вставить("Периодичность", Перечисления.Периодичность.Неделя);
	
	// --------------
	
	Возврат НастройкиВиджета;
	
КонецФункции // ПолучитьНастройки_ДинамикаПродаж()

// Функция используется для получения пустых настроек виджета дебиторской задолженности.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки_ДебиторскаяЗадолженность() Экспорт
	
	НастройкиВиджета = Новый Структура;
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ДинамическоеЗначениеАналитики", Ложь);
	
	// Типы: ПеречислениеСсылка.CRM_ВидыРазверткиПоказателей
	НастройкиВиджета.Вставить("ТипАналитики", Перечисления.CRM_ВидыРазверткиПоказателей.ПоВсейКомпании);
	
	// Типы: СправочникСсылка.СтруктураПредприятия | СправочникСсылка.Пользователи
	НастройкиВиджета.Вставить("ЗначениеАналитики", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	// Типы: СтандартнаяДатаНачала
	НастройкиВиджета.Вставить("Период", Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня));
	
	// +CRM_Модуль
	// Типы: ПеречислениеСсылка.Периодичность
	//НастройкиВиджета.Вставить("Периодичность", Перечисления.Периодичность.Год);
	// -CRM_Модуль
	
	// --------------
	
	Возврат НастройкиВиджета;
	
КонецФункции // ПолучитьНастройки_ДебиторскаяЗадолженность()

// Функция используется для получения пустых настроек виджета воронки продаж.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки_ВоронкаПродаж() Экспорт
	
	НастройкиВиджета = Новый Структура;
	
	////////////////////////////////////
	// Основные отборы.
	
	// Типы: СправочникСсылка.БизнесРегионы
	НастройкиВиджета.Вставить("ОтборРегион", Справочники.БизнесРегионы.ПустаяСсылка());
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ОтборТолькоНовые", Ложь);
	
	// Типы: СправочникСсылка.СегментыПартнеров
	НастройкиВиджета.Вставить("ОтборСегментКлиентов", Справочники.СегментыПартнеров.ПустаяСсылка());
	
	// Типы: ПланВидовХарактеристикСсылка.КаналыРекламныхВоздействий
	НастройкиВиджета.Вставить("ПоискИсточникПривлечения", ПланыВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка());
	
	// Типы: ЛюбаяСсылка
	НастройкиВиджета.Вставить("ПоискЗначениеИсточникаПривлечения", Неопределено);
	
	////////////////////////////////////
	// Дополнительные.
	
	// Типы: СправочникСсылка.CRM_ОфисыКомпании
	НастройкиВиджета.Вставить("ОтборОфис", Справочники.CRM_ОфисыКомпании.ПустаяСсылка());
	
	// Типы: СписокЗначений
	НастройкиВиджета.Вставить("ОтборТипыУслуг", Новый СписокЗначений);
	
	// Типы: СправочникСсылка.СтруктураПредприятия
	НастройкиВиджета.Вставить("ОтборПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	// Типы: СписокЗначений
	НастройкиВиджета.Вставить("ОтборОтветственные", Новый СписокЗначений);
	
	// Типы: СправочникСсылка.СтруктураПредприятия, Строка, СправочникСсылка.Пользователи
	НастройкиВиджета.Вставить("СравнитьСПользовательПодразделение", "");
	
	////////////////////////////////////
	// Период.
	
	// Типы: 
	НастройкиВиджета.Вставить("ОтборПериод", Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	
	// Типы: 
	НастройкиВиджета.Вставить("ОтборТеги", Новый СписокЗначений);
	
	////////////////////////////////////
	// Теги.
	
	// Типы: СправочникСсылка.СтруктураПредприятия
	НастройкиВиджета.Вставить("ОтборПодразделениеДляТегов", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	////////////////////////////////////
	// Прочее.
	
	// Типы: СправочникСсылка.CRM_ВоронкиПродаж
	НастройкиВиджета.Вставить("Воронка", Справочники.CRM_ВоронкиПродаж.Интересы);
	
	// Типы: Строка
	НастройкиВиджета.Вставить("Показатель", "Сумма");
	
	// Типы: Строка
	НастройкиВиджета.Вставить("РежимВоронки", "Все");
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ОтбиратьПоТегам", Ложь);
	
	////////////////////////////////////
	// Служебные.
	
	// Типы: СписокЗначений
	НастройкиВиджета.Вставить("СписокОбъектовСТегами", Новый СписокЗначений);
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ЕстьЭтапыПоДокументам", Ложь);
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ЕстьЭтапыПоИнтересам", Ложь);
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ЕстьЭтапыПоКартамМаршрута", Ложь);
	
	////////////////////////////////////
	// Этапы.
	
	// Типы: Массив
	НастройкиВиджета.Вставить("ЭтапыТекущейВоронки", Новый Массив);
	
	// --------------
	
	Возврат НастройкиВиджета;
	
КонецФункции // ПолучитьНастройки_ВоронкаПродаж()

// Функция используется для получения пустых настроек виджета динамики статусов клиентов.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки_ДинамикаСтатусовКлиентов() Экспорт
	
	НастройкиВиджета = Новый Структура;
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ДинамическоеЗначениеАналитики", Ложь);
	
	// Типы: ПеречислениеСсылка.CRM_ВидыРазверткиПоказателей
	НастройкиВиджета.Вставить("ТипАналитики", Перечисления.CRM_ВидыРазверткиПоказателей.ПоВсейКомпании);
	
	// Типы: СправочникСсылка.СтруктураПредприятия | СправочникСсылка.Пользователи
	НастройкиВиджета.Вставить("ЗначениеАналитики", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	// Типы: СтандартныйПериод
	НастройкиВиджета.Вставить("СтандартныйПериод", Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	
	// Типы: ПеречислениеСсылка.Периодичность
	НастройкиВиджета.Вставить("Периодичность", Перечисления.Периодичность.Неделя);
	
	// --------------
	
	Возврат НастройкиВиджета;
	
КонецФункции // ПолучитьНастройки_ДинамикаСтатусовКлиентов()

// Функция используется для получения пустых настроек виджета статистики телефонных звонков.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки_СтатистикаТелефонныхЗвонков() Экспорт
	
	НастройкиВиджета = Новый Структура;
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ДинамическоеЗначениеАналитики", Ложь);
	
	// Типы: ПеречислениеСсылка.CRM_ВидыРазверткиПоказателей
	НастройкиВиджета.Вставить("ТипАналитики", Перечисления.CRM_ВидыРазверткиПоказателей.ПоВсейКомпании);
	
	// Типы: СправочникСсылка.СтруктураПредприятия | СправочникСсылка.Пользователи
	НастройкиВиджета.Вставить("ЗначениеАналитики", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	// Типы: СтандартныйПериод
	НастройкиВиджета.Вставить("СтандартныйПериод", Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	
	// --------------
	
	Возврат НастройкиВиджета;
	
КонецФункции // ПолучитьНастройки_СтатистикаТелефонныхЗвонков()

// Функция используется для получения пустых настроек виджета трудозатрат времени по видам работ.
//
// Возвращаемое значение:
//   Структура  - Пустые настройки виджета.
//
Функция ПолучитьНастройки_ТрудозатратыВремениПоВидамРабот() Экспорт
	
	НастройкиВиджета = Новый Структура;
	
	// Типы: Булево
	НастройкиВиджета.Вставить("ДинамическоеЗначениеАналитики", Ложь);
	
	// Типы: ПеречислениеСсылка.CRM_ВидыРазверткиПоказателей
	НастройкиВиджета.Вставить("ТипАналитики", Перечисления.CRM_ВидыРазверткиПоказателей.ПоВсейКомпании);
	
	// Типы: СправочникСсылка.СтруктураПредприятия | СправочникСсылка.Пользователи
	НастройкиВиджета.Вставить("ЗначениеАналитики", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	// Типы: СтандартныйПериод
	НастройкиВиджета.Вставить("СтандартныйПериод", Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	
	// --------------
	
	Возврат НастройкиВиджета;
	
КонецФункции // ПолучитьНастройки_ТрудозатратыВремениПоВидамРабот()

#КонецОбласти

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////