////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля объекта "Справочники.CRM_ВариантыВиджетов".
//
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Используется = Ложь;
	КонецЕсли;
	
	НастройкиВиджета = НастройкиВарианта.Получить();
	
	Если НастройкиВиджета = Неопределено Тогда
		НастройкиВиджета = Справочники.CRM_ВариантыВиджетов.ПолучитьНастройки(ЭтотОбъект.Виджет);
		ЭтотОбъект.НастройкиВарианта = Новый ХранилищеЗначения(НастройкиВиджета);
	КонецЕсли;
	
	Если НастройкиВиджета <> Неопределено Тогда
		КонтрольнаяСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(НастройкиВиджета);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////