#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.cbr_Задача") Тогда
		Часы = 8;
		Основание = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
ОшибкаДвижений = cbr_ДвиженияПоРегистрам.ДвижениеЧасыТрудозатрат(Ссылка, Часы, Дата, Основание);

Если ОшибкаДвижений Тогда
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Часов больше чем согласовано";
	Сообщение.Сообщить();
КонецЕсли;
КонецПроцедуры

#КонецОбласти