
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВладелецШаблона = ПользователиКлиентСервер.ТекущийПользователь();
	ИмяФормы 		= ПараметрыВыполненияКоманды.Источник.ИмяФормы;
	
	Если СтрНайти(ИмяФормы, "ФормаДокумента") ИЛИ СтрНайти(ИмяФормы, "ФормаЭлемента") Тогда
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВладелецШаблона,Объект,
			|ТипФормы", ВладелецШаблона, ПараметрКоманды,
			 "ФормаДокумента"));
	ИначеЕсли СтрНайти(ИмяФормы, "ФормаСписка") ИЛИ СтрНайти(ИмяФормы, "ФормаВыбора") Тогда
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВладелецШаблона,Объект,
			|ТипФормы", ВладелецШаблона, ПараметрКоманды,
			 "ФормаСписка") );
	КонецЕсли;
	
	ОткрытьФорму("Справочник.CRM_ШаблоныОбъектов.ФормаОбъекта", ПараметрыФормы,
		 ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		 ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
