#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить элементы справочника
//  Процедура заполняет тип состояния элемента справочника CRM_СостоянияСобытий.
//
Процедура ЗаполнитьЭлементыСправочника() Экспорт
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияСобытий
	|ГДЕ
	|	ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.ПустаяСсылка)
	|");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если Объект.Предопределенный Тогда
            ИмяЗначенияПеречисления = Справочники.CRM_СостоянияСобытий.ПолучитьИмяПредопределенного(Выборка.Ссылка);
			Если Метаданные.Перечисления.CRM_ТипыСостоянийСобытий.ЗначенияПеречисления.Найти(
					ИмяЗначенияПеречисления) <> Неопределено Тогда
				
				Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий[ИмяЗначенияПеречисления];
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Объект.ТипСостояния) Тогда
				Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.ВРаботе;
			КонецЕсли;
		Иначе
			Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.ВРаботе;
		КонецЕсли;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли