
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия = CRM_РабочийСтолСервер.ПолучитьПараметрыОткрытияФормы("Обработка.CRM_АРМПланированияВстреч.Форма.ФормаАРМ",
		 ПараметрыОткрытия);
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПараметрыОткрытия.Вставить("Ключ", Объект.Ссылка);
	КонецЕсли;	
	ОткрытьФорму("Обработка.CRM_АРМПланированияВстреч.Форма.ФормаАРМ", ПараметрыОткрытия);
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
