
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Ссылка = ПланыОбмена.CRM_ОбменB2BПортал.ЭтотУзел() Тогда
		Элементы.URL.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Логин.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Таймаут.АвтоОтметкаНезаполненного = Ложь;
		Элементы.URL.Доступность = Ложь;
		Элементы.Логин.Доступность = Ложь;
		Элементы.Таймаут.Доступность = Ложь;
		Элементы.Пароль.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы