
#Область ОбработчикиСобытий

Функция Пинг(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("OK");
	Возврат Ответ;
	
КонецФункции

Функция Версия(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(CRM_ОбменB2BПортал.ВерсияФорматаОбмена());
	Возврат Ответ;
	
КонецФункции

Функция ПередатьИзменения(Запрос)
	
	СообщениеОбмена = Запрос.ПолучитьТелоКакСтроку();
	Если ЗначениеЗаполнено(СообщениеОбмена) Тогда
		ДлительныеОперации.ВыполнитьПроцедуру(, "CRM_ОбменB2BПортал.ПрочитатьСообщениеОбмена", СообщениеОбмена);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьИзменения(Запрос)
	
	СообщениеОбмена = CRM_ОбменB2BПортал.СоздатьСообщениеОбмена();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СообщениеОбмена);
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
