////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля объекта "Справочники.CRM_Виджеты".
//
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ТипИсточникаДанных = Перечисления.CRM_ТипыИсточниковДанныхВиджетов.КлючевойПоказатель;
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////