
#Область ПрограммныйИнтерфейс

Процедура УстановитьШрифтПоУмолчанию() Экспорт
	
	ШрифтПоУмолчанию = Новый Шрифт("Times New Roman", 12);
	
	Константы.CRM_ШрифтПисьмаПоУмолчанию.УстановитьШрифтВКонстанту(ШрифтПоУмолчанию);
	
КонецПроцедуры // ЗаполнитьШрифтПисьмаПоУмолчанию()

Процедура УстановитьШрифтВКонстанту(УстанавливаемыйШрифт) Экспорт
	
	СериализованноеЗначениеДляСохранения = ЗначениеВСтрокуВнутр(УстанавливаемыйШрифт);
	Константы.CRM_ШрифтПисьмаПоУмолчанию.Установить(СериализованноеЗначениеДляСохранения);
	
КонецПроцедуры // УстановитьШрифтВКонстанту()

Функция ПолучитьШрифт() Экспорт
	
	СериализованноеЗначениеШрифта = Константы.CRM_ШрифтПисьмаПоУмолчанию.Получить();
	Возврат ЗначениеИзСтрокиВнутр(СериализованноеЗначениеШрифта);
	
КонецФункции // ПолучитьШрифт()

#КонецОбласти
