#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДекорацияGooglreНастройкаПодключения.Гиперссылка = ПравоДоступа("Администрирование", Метаданные);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "Нажатие элемента" формы "ДекорацияGoogleПодробнаяИнформация".
//
Процедура ДекорацияGoogleПодробнаяИнформацияНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапускПриложенияНажатие", ЭтотОбъект);
	НачатьЗапускПриложения(ОписаниеОповещения, "http://daclouds.ru/#order_subscribe");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапускПриложенияНажатие(КодВозврата, ДополнительныеПараметры) Экспорт
	// Действие не требуется	
	Результат = Истина;
КонецПроцедуры

#КонецОбласти
