#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборДействует = "Все";
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОтборДействуетПриИзмененииСервер();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОтборДействуетПриИзмененииСервер()
	Если ОтборДействует = "Все" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Действует", Истина, , , Ложь);
	ИначеЕсли ОтборДействует = "Действует" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Действует", Истина, , , Истина);
	ИначеЕсли ОтборДействует = "НеДействует" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Действует", Ложь, , , Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДействуетПриИзменении(Элемент)
	ОтборДействуетПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Действует" Тогда
		
		СтандартнаяОбработка = Ложь;
		ВключитьВыключитьТриггер(ВыбраннаяСтрока);
		Элементы.Список.Обновить();
		
	Иначе
		
		CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
			"CRM_Статистика.Триггеры.Триггер.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.Триггеры.Триггер.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВключитьВыключитьТриггер(Триггер)
	ТриггерОбъект = Триггер.ПолучитьОбъект();
	ТриггерОбъект.Действует = НЕ ТриггерОбъект.Действует;
	ТриггерОбъект.Записать();
КонецПроцедуры
