#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнениеВариантаПолученияФакта() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	     |	CRM_ПланПродаж.Ссылка КАК Ссылка
	     |ИЗ
	     |	Справочник.CRM_ПланПродаж КАК CRM_ПланПродаж
	     |ГДЕ
	     |	CRM_ПланПродаж.ВариантПолученияФакта = ЗНАЧЕНИЕ(Перечисление.CRM_ВариантыПолученияФактаПродажи.ПустаяСсылка)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОб = Выборка.Ссылка.ПолучитьОбъект();
		СпрОб.ВариантПолученияФакта = Перечисления.CRM_ВариантыПолученияФактаПродажи.ПоВыручке;
		СпрОб.ОбменДанными.Загрузка = Истина;
		СпрОб.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли