///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

//
// Модуль корректно компилируется и работает только на платформе 8.3.23
// На платформе младшей версии возможны ошибки статанализа и исполнения
//

#Область СлужебныйПрограммныйИнтерфейс

Функция ПоддерживаетсяИспользованиеВнешнегоРасположения() Экспорт
	
	Возврат РаботаСРечью.ПоддерживаетсяИспользованиеВнешнегоРасположения();
	
КонецФункции

Функция НовыйПараметрыВнешнегоПодключенияРаботыСРечью(Токен, Адрес) Экспорт
	
	Если Адрес = Неопределено Тогда
		Возврат Новый ПараметрыВнешнегоПодключенияРаботыСРечью(Токен);
	Иначе
		Возврат Новый ПараметрыВнешнегоПодключенияРаботыСРечью(Токен, Адрес);
	КонецЕсли;
	
КонецФункции

Функция ВариантИспользованияРасположенияРаботыСРечью() Экспорт
	
	Возврат ВариантИспользованияРасположенияРаботыСРечью;
	
КонецФункции

Процедура ВыполнитьРегистрациюСеанса(Логин, Пароль, Адрес) Экспорт
	
	Если Адрес = Неопределено Тогда 
		РаботаСРечью.ВыполнитьРегистрациюСеанса(Логин, Пароль);
	Иначе
		РаботаСРечью.ВыполнитьРегистрациюСеанса(Логин, Пароль, Адрес);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПараметрыВнешнегоПодключенияИнформационнойБазы() Экспорт
	
	Возврат РаботаСРечью.ПолучитьПараметрыВнешнегоПодключенияИнформационнойБазы();
	
КонецФункции

Процедура УстановитьПараметрыВнешнегоПодключенияИнформационнойБазы(Параметры) Экспорт
	
	РаботаСРечью.УстановитьПараметрыВнешнегоПодключенияИнформационнойБазы(Параметры);
	
КонецПроцедуры

Функция ПолучитьПараметрыВнешнегоПодключенияСеанса() Экспорт
	
	Возврат РаботаСРечью.ПолучитьПараметрыВнешнегоПодключенияСеанса();
	
КонецФункции

Процедура УстановитьПараметрыВнешнегоПодключенияСеанса(Параметры) Экспорт
	
	РаботаСРечью.УстановитьПараметрыВнешнегоПодключенияСеанса(Параметры);
	
КонецПроцедуры

Функция НовыйИдентификаторМоделиРаспознаванияРечи(ИдентификаторМодели) Экспорт
	
	Возврат Новый ИдентификаторМоделиРаспознаванияРечи(ИдентификаторМодели);
	
КонецФункции

Функция ПолучитьОписаниеМоделейРаспознавания() Экспорт
	
	Возврат РаботаСРечью.ПолучитьОписаниеМоделейРаспознавания();
	
КонецФункции

Функция ПолучитьМодельРаспознаванияВоВременноеХранилище(ИдентификаторМодели) Экспорт
	
	Возврат РаботаСРечью.ПолучитьМодельРаспознаванияВоВременноеХранилище(ИдентификаторМодели);
	
КонецФункции

Процедура УстановитьМодельРаспознаванияДляИнформационнойБазы(Источник) Экспорт 
	
	РаботаСРечью.УстановитьМодельРаспознаванияДляИнформационнойБазы(Источник);
	
КонецПроцедуры

Процедура УдалитьМодельРаспознаванияДляИнформационнойБазы(ИдентификаторМодели) Экспорт
	
	РаботаСРечью.УдалитьМодельРаспознаванияДляИнформационнойБазы(ИдентификаторМодели);
	
КонецПроцедуры

Процедура УстановитьДополнительнуюГрамматикуСеанса(Ключ, ДополнительнаяГрамматика) Экспорт
	
	РаботаСРечью.УстановитьДополнительнуюГрамматикуСеанса(Ключ, ДополнительнаяГрамматика);
	
КонецПроцедуры

Процедура УдалитьДополнительнуюГрамматикуСеанса(Ключ) Экспорт
	
	РаботаСРечью.УдалитьДополнительнуюГрамматикуСеанса(Ключ);
	
КонецПроцедуры

#КонецОбласти