
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь		= Пользователи.ТекущийПользователь();
	ЕстьПраваАдминистратора	= (РольДоступна("ПолныеПрава") Или РольДоступна("Администрирование"));
	
	Элементы.Пользователь.Видимость = ЕстьПраваАдминистратора;
	
	CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, "Пользователь", ТекущийПользователь, Не ЕстьПраваАдминистратора, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти
