
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.Продажи.ПланированиеПродаж.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
	ПараметрыОткрытия = Новый Структура("CRM_КонтекстВызова", "РазделКлиенты");
	ПараметрыОткрытия = CRM_РабочийСтолСервер.ПолучитьПараметрыОткрытияФормы("Обработка.CRM_ПланированиеПродаж.Форма.Форма",
		 ПараметрыОткрытия);
	ОткрытьФорму("Обработка.CRM_ПланированиеПродаж.Форма.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти
