
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийЭлемент = Элементы.КнопкаКупить;
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияПодробнаяИнформацияНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://telefon.1crm.ru/#cost");
КонецПроцедуры

&НаКлиенте
Процедура КупитьПрограмму(Команда)
	ПерейтиПоНавигационнойСсылке("http://rarus.ru/1c-crm/1c-rarus-integratsiya-s-telefoniey-softfon-redaktsiya-3/");
КонецПроцедуры

&НаКлиенте
Процедура ПопробоватьБесплатно(Команда)
	ПерейтиПоНавигационнойСсылке("https://telefon.1crm.ru/#try-free");
КонецПроцедуры

#КонецОбласти
