
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметрыформы = Параметры;
	Партнер = Параметрыформы.Партнер;
	КонтактноеЛицо = Параметрыформы.КонтактноеЛицо;
	Проект = Параметрыформы.Проект;
	Этап = Параметрыформы.Этап;
	ВариантСрока = Параметрыформы.ВариантСрока;
	ПоказатьАвтора = Параметрыформы.ПоказатьАвтора;
	ПотенциальныйКлиент = Параметрыформы.ПотенциальныйКлиент;
	Элементы.ПотенциальныйКлиент.Видимость = ЗначениеЗаполнено(ПотенциальныйКлиент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		КонтактноеЛицо = ВернутьКонтактноеЛицо(Партнер);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда 
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Проект) Тогда 
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Партнер", Партнер);
	СтруктураПараметров.Вставить("КонтактноеЛицо", КонтактноеЛицо);
	СтруктураПараметров.Вставить("Проект", Проект);
	СтруктураПараметров.Вставить("Этап", Этап);
	СтруктураПараметров.Вставить("ВариантСрока", ВариантСрока);
	СтруктураПараметров.Вставить("ПоказатьАвтора", ПоказатьАвтора);
	СтруктураПараметров.Вставить("ПотенциальныйКлиент", ПотенциальныйКлиент);
	Закрыть(СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаРедактирования(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьКонтактноеЛицо(Партнер)
	
	КонтактноеЛицо = Партнер.CRM_ОсновноеКонтактноеЛицо;
	
	Если КонтактноеЛицо = ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка") Тогда
		Возврат Неопределено;
	Иначе
		Возврат КонтактноеЛицо;
	КонецЕсли;		
	
КонецФункции

#КонецОбласти
