#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Записывает номер полученного сообщения
//
// Параметры:
//  Бот		 - Справочник.гбБоты	 - бот
//  Номер	 - Число	 - Номер полученного сообщения
//
Процедура ЗаписатьНомерПолученного(Бот, Номер) Экспорт
	Запись = РегистрыСведений.гбНомераОбновлений.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.НомерОбновления = Номер;
    Запись.Записать();
КонецПроцедуры // ЗаписатьНомерПолученного


// Очищает номер полученного сообщения
//
// Параметры:
//  Бот		 - Справочник.гбБоты	 - бот
//
Процедура ОчиститьНомерПолученного(Бот) Экспорт
	Запись = РегистрыСведений.гбНомераОбновлений.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.Удалить();
КонецПроцедуры // ОчиститьНомерПолученного


// Возвращает номер полученного сообщения
//
// Параметры:
//  Бот		 - Справочник.гбБоты	 - бот
// 
// Возвращаемое значение:
//  Число	 - Номер полученного сообщения
//
Функция ПолучитьНомерПолученного(Бот) Экспорт
	Запись = РегистрыСведений.гбНомераОбновлений.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.Прочитать();
	
	Возврат ?(Запись.Выбран(), Запись.НомерОбновления, Неопределено);
КонецФункции // ПолучитьНомерПолученного

#КонецОбласти

#КонецЕсли
