#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция РолиПользователя(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Роли.Роль КАК Роль
	                      |ИЗ
	                      |	Справочник.ПрофилиГруппДоступа.Роли КАК Роли
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	                      |			ПО (СоставыГруппПользователей.Пользователь = &Пользователь)
	                      |				И (СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
	                      |				И (НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления)
	                      |		ПО Роли.Ссылка = ГруппыДоступаПользователи.Ссылка.Профиль
	                      |			И (НЕ Роли.Ссылка.ПометкаУдаления)");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Роль");
	
КонецФункции

Функция ГруппыДоступаПользователя(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ГруппыДоступаПользователи.Ссылка КАК Группа
	                      |ИЗ
	                      |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	                      |		ПО (СоставыГруппПользователей.Пользователь = &Пользователь)
	                      |			И (СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
	                      |			И (НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления)");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Группа");
	
КонецФункции

#КонецОбласти

#КонецЕсли