#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура СоздатьЭлементыПоУмолчанию() Экспорт
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не удается связаться';en='Unable to connect'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не одобрило руководство';en='It is not approved by Management'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Выбрал конкурента';en='Chose competitor'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Нужна была только консультация';en='Need only consultation'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не устроила цена';en='Not satisfied with the price'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не устроило качество обслуживания';en='Not satisfied with quality of service'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не устроило качество продукции';en='Not satisfied with quality of products'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Нецелевой клиент';en='Untargeted Customer'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Нет денег';en='No money'");
	НовыйЭлемент.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли