#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Создать запись в регистр сведений, возвращает количество часов из предыдущей записи документа
// Параметры:
//	Документ - ДокументСсылка.cbr_ТрудозатратыПоЗадаче
//	Дата - Дата
//  Задача - ДокументСсылка.cbr_Задача
//  Часы - Число
// Возвращаемое значение:
//	Число - количество часов из предыдущей записи документа Документ.
Функция ЗаписатьТрудозатраты(Документ, Дата, Задача, Часы) Экспорт
	ЧасыПредыдущейЗаписи = 0;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Документ);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		ЧасыПредыдущейЗаписи = НаборЗаписей[0].Часы;
	КонецЕсли;
	
	НаборЗаписей.Очистить();
	НаборЗаписей.Записывать = Истина;
	Запись = НаборЗаписей.Добавить();
	Запись.Период = Дата;
	Запись.Регистратор = Задача;
	Запись.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	Запись.Часы = Часы;
	НаборЗаписей.Записать(РежимЗамещения.Замещение);
	
	Возврат ЧасыПредыдущейЗаписи;
КонецФункции
#КонецОбласти
#КонецЕсли