#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет обработку данных для перехода на новую версию.
//
// Параметры:
//  Параметры	 - Структура	 - Параметры.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Истина;
	
	РегистрыСведений.CRM_ПотокиДоставкиПочты.ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

// Процедура выполняет заполнение по умолчанию.
//
Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УчетныеЗаписи.Ссылка КАК УчетнаяЗапись,
	|	0 КАК НомерПотока
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ПотокиДоставкиПочты КАК ПотокиДоставкиПочты
	|		ПО (ПотокиДоставкиПочты.УчетнаяЗапись = УчетныеЗаписи.Ссылка)
	|ГДЕ
	|	ПотокиДоставкиПочты.УчетнаяЗапись ЕСТЬ NULL");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.CRM_ПотокиДоставкиПочты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
