
&НаКлиенте
Процедура ПодключитьсяКХранилищу(Команда)
	ПодключитьсяКХранилищуНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОСозданииХранилища", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Хранилище не найдено. Создать новое?", РежимДиалогаВопрос.ДаНет);
	Иначе
		Элементы.Код.ТолькоПросмотр = Истина;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СуществующийЭлемент;
		
		Элементы.СохранитьПараметры.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
	ОповеститьОбИзменении(ТипЗнч(Объект.Ссылка));
КонецПроцедуры

&НаСервере
Процедура ПодключитьсяКХранилищуНаСервере()
	Если гбХранилище.ВыполнитьУдаленно(Объект, "ХранилищеСуществует") тогда
		Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОСозданииХранилища(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Да тогда
		Возврат;
	КонецЕсли;
	
	СоздатьХранилищеНаСервере();
	
	Элементы.Код.ТолькоПросмотр = Истина;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СуществующийЭлемент;
	
	Элементы.СохранитьПараметры.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры


&НаСервере
Процедура СоздатьХранилищеНаСервере()
	гбХранилище.ВыполнитьУдаленно(Объект, "СоздатьХранилище");
	Записать();
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКУправлениюПользователями(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СохранитьПараметры(Команда)
	Записать();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если ЗначениеЗаполнено(Параметры.Ключ) тогда
		Элементы.Код.ТолькоПросмотр = Истина;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СуществующийЭлемент;
		
		Элементы.СохранитьПараметры.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ГрафиБот:ИзменениеСостоянияХранилищаБлокСхем");
КонецПроцедуры

