
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодразделения = CRM_ОбщегоНазначенияПовтИсп.ИспользоватьПодразделения();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураФильтра);
	ТекущийПользовательСтарый = ТекущийПользователь;
	Если ТипЗнч(ТекущийПользователь) <> Тип("СправочникСсылка.Пользователи") Тогда
		ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяРоль) Тогда
		ТекущаяРоль = НСтр("ru = '<Все роли>'; en = '<All roles>'");
	КонецЕсли;
	
	Элементы.ПоискПодразделение.Видимость = ИспользоватьПодразделения;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьТекущийВариантПериода();
	ИзменитьОтображениеПолейОтборов();
	ЗаполнитьСписокРолейПользователя();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСозданыСегодняНажатие(Элемент)
	Если Элемент.Имя = "ОтборСозданыСегодня" Тогда
		ВариантПериода = "Сегодня";
	ИначеЕсли Элемент.Имя = "ОтборСозданыЗа3Дня" Тогда
		ВариантПериода = "3 дня";
	ИначеЕсли Элемент.Имя = "ОтборСозданыЗаНеделю" Тогда
		ВариантПериода = "Неделя";
	ИначеЕсли Элемент.Имя = "ОтборСозданыЗаМесяц" Тогда
		ВариантПериода = "Месяц";
	ИначеЕсли Элемент.Имя = "ОтборОчистить" Тогда
		ВариантПериода = "";	
	КонецЕсли;	
	ПоказатьТекущийВариантПериода();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПользовательПриИзменении(Элемент)
	ТекущийПользовательПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяРоль = НСтр("ru = '<Все роли>'; en = '<All roles>'");
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ТекущаяРольЗавершениеВыбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.РолиИсполнителей.ФормаВыбора", , ЭтотОбъект, , , , Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольЗавершениеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяРоль = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ТипЗнч(ТекущаяРоль) = Тип("Строка") Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.РолиИсполнителей");
		ТекущаяРоль = ОписаниеТипа.ПривестиЗначение(ТекущаяРоль);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	Закрыть(ПолучитьСтруктуруФильтра());
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
	ИзменитьОтображениеПолейОтборов();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодОчистить(Команда)
	ВариантПериода = "";
	ПоказатьТекущийВариантПериода();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоле(Команда)
	
	Элементы.ГруппаТекущаяРоль.Видимость = Истина;
	ОтборПоРолиУстановлен = Истина;
	ИзменитьОтображениеКнопкиСоздания();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоле(Команда)
	
	Если Команда.Имя = "УдалитьПолеТекущаяРоль" Тогда
		Элементы.ГруппаТекущаяРоль.Видимость = Ложь;
		ОтборПоРолиУстановлен = Ложь;
	КонецЕсли;
	
	ИзменитьОтображениеКнопкиСоздания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьТекущийВариантПериода()
	Если ВариантПериода = "Сегодня" Тогда
		Элементы.ОтборСозданыСегодня.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыСегодня.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	ИначеЕсли ВариантПериода = "3 дня" Тогда
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	Иначе
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;	
		
		Элементы.ОтборОчистить.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборОчистить.ЦветТекста = Новый Цвет(255, 255, 255);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруФильтра()
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("ОтборВключен", ОтборВключен);
	СтруктураФильтра.Вставить("ОтображатьЗвонки", ОтображатьЗвонки);
	СтруктураФильтра.Вставить("ОтображатьПисьма", ОтображатьПисьма);
	СтруктураФильтра.Вставить("ОтображатьСообщенияЧатов", ОтображатьСообщенияЧатов);
	СтруктураФильтра.Вставить("ОтображатьТелемаркетинг", ОтображатьТелемаркетинг);
	СтруктураФильтра.Вставить("ВариантПериода", ВариантПериода);
	СтруктураФильтра.Вставить("ТекущийПользователь", ТекущийПользователь);
	СтруктураФильтра.Вставить("ПоискКлиент", ПоискКлиент);
	СтруктураФильтра.Вставить("ПоискПодразделение", ПоискПодразделение);
	СтруктураФильтра.Вставить("ОтборПоРолиУстановлен", ОтборПоРолиУстановлен);
	СтруктураФильтра.Вставить("ТекущаяРоль", ?(ТипЗнч(ТекущаяРоль) = Тип("СправочникСсылка.РолиИсполнителей")
		 И ОтборПоРолиУстановлен,
		 ТекущаяРоль, Справочники.РолиИсполнителей.ПустаяСсылка()));
	
	Возврат СтруктураФильтра;
КонецФункции

&НаСервере
Процедура ОчиститьНаСервере()
	
	ПоискКлиент = Справочники.Партнеры.ПустаяСсылка();
	ПоискПодразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекущаяРоль = НСтр("ru = '<Все роли>'; en = '<All roles>'");
	ОтборПоРолиУстановлен = Истина;
	ВариантПериода = "";
	ПоказатьТекущийВариантПериода();
	
КонецПроцедуры

&НаСервере
Процедура ТекущийПользовательПриИзмененииНаСервере()
	Если ТекущийПользовательСтарый <> ТекущийПользователь Тогда
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
			Подразделение = ТекущийПользователь.Подразделение;
			СписокВышестоящихПодразделений.ЗагрузитьЗначения(CRM_МетодыМодулейМенеджеровСправочников.ПолучитьВсеПодразделенияРодители(Подразделение,
				 Истина));
		Иначе
			ТекущийПользователь = ТекущийПользовательСтарый;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПользовательОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеПолейОтборов()
	
	Элементы.ГруппаТекущаяРоль.Видимость = ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен;
	ИзменитьОтображениеКнопкиСоздания();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеКнопкиСоздания()
	
	Элементы.ДобавитьПолеТекущийПользователь.Видимость = НЕ Элементы.ГруппаТекущаяРоль.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРолейПользователя()
	
	Элементы.ТекущаяРоль.СписокВыбора.Очистить();
	Элементы.ТекущаяРоль.СписокВыбора.Добавить(НСтр("ru = '<Все роли>'; en = '<All roles>'"));
	
КонецПроцедуры

#КонецОбласти
