#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьКолонкуПользователя(Пользователь, Доска, НастройкиКолонки, Наименование, Цвет, 
	Номер = Неопределено) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.Доска.Установить(Доска);
	Если Номер <> Неопределено Тогда
		Набор.Отбор.Номер.Установить(Номер);
	КонецЕсли;
	Набор.Прочитать();
	Если Набор.Количество() Тогда
		Запись = Набор[0];
		Запись.НастройкиКолонки = НастройкиКолонки;
		Запись.Наименование = Наименование;
		Запись.Цвет = Цвет;
	Иначе
		Запись = Набор.Добавить();
		Запись.Пользователь = Пользователь;
		Запись.Доска = Доска;
		Запись.Номер = Номер;
		Запись.Цвет = Цвет;
		Запись.Наименование = Наименование;
		Запись.НастройкиКолонки = НастройкиКолонки;
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры

Процедура ЗаписатьКолонкуПоУмолчанию(Доска, НастройкиКолонки, Наименование, Цвет) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	Набор.Отбор.Доска.Установить(Доска);
	Набор.Прочитать();

	Запись = Набор.Добавить();
	Запись.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	Запись.Доска = Доска;
	Запись.Номер = Набор.Количество();
	Запись.Наименование = Наименование;
	Запись.Цвет = Цвет;
	Запись.НастройкиКолонки = НастройкиКолонки;

	Набор.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли