
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомпановщикНастроекУсловий.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтотОбъект.Параметры.АдресСхемыКомпоновкиДанных));
	НастройкиСКД = Параметры.НастройкиСКД;
	КомпановщикНастроекУсловий.ЗагрузитьНастройки(НастройкиСКД);
	КомпановщикНастроекУсловий.Восстановить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	Закрыть(КомпановщикНастроекУсловий.Настройки);
КонецПроцедуры

#КонецОбласти
