
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Подключение", ПараметрКоманды);
	ПараметрыФормы.Вставить("Действие", ПредопределенноеЗначение("Перечисление.гбДействияХранилища.ОбновитьВсеИзХранилища"));
	ОткрытьФорму("Справочник.гбХранилищаБлокСхем.Форма.ДействияСоСпискомОбъектов", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
