
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриОпределенииОписанияСвойствОбъектовДляПоиска(ТипОбъекта, ОписаниеСвойств) Экспорт
	
	Если Не CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM()
		И (ТипОбъекта = Тип("СправочникОбъект." + "Контрагенты")
		Или ТипОбъекта = Тип("СправочникСсылка." + "Контрагенты")) Тогда
		ОписаниеСвойств.Вставить("ИНН", Перечисления.CRM_ПоляПоискаКонтактов.ИНН);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииКонтактаДанныхПоиска(ТипОбъекта, Контакт, ОбъектПоиска) Экспорт
	
	Если Не CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM()
		И (ТипОбъекта = Тип("СправочникОбъект." + "Контрагенты")
		Или ТипОбъекта = Тип("СправочникСсылка." + "Контрагенты")) Тогда
		Контакт = ОбъектПоиска.Партнер;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
