
////////////////////////////////////////////////////////////////////////////////
// Напоминания клиент
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Процедура для выводит активные напоминания.
//
// Параметры:
//	Нет.
//
Процедура CRM_ВывестиАктивныеНапоминания() Экспорт
	CRM_НапоминанияКлиент.ВывестиАктивныеНапоминания();
КонецПроцедуры // CRM_ВывестиАктивныеНапоминания()

// Процедура выводит активные напоминания о входящих письмах.
//
// Параметры:
//	Нет.
//
Процедура CRM_ВывестиАктивныеНапоминанияОВходящихПисьмах() Экспорт
	CRM_НапоминанияКлиент.ВывестиАктивныеНапоминанияОВходящихПисьмахСообщениях("НапоминанияОВходящихПисьмах");
КонецПроцедуры // CRM_ВывестиАктивныеНапоминания()

// Процедура выводит активные напоминания о сообщениях мессенджеров.
//
// Параметры:
//	Нет.
//
Процедура CRM_ВывестиАктивныеНапоминанияОСообщенияхМессенджеров() Экспорт
	CRM_НапоминанияКлиент.ВывестиАктивныеНапоминанияОВходящихПисьмахСообщениях("НапоминанияОСообщенияхМессенджеров");
КонецПроцедуры

#КонецОбласти