#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Создать набор записей в регистр сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Связанные - Массив Из ДокументСсылка.cbr_Задача.
Процедура ЗаписатьСвязиДляЗадачи(Задача, Связанные) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого Связанная Из Связанные Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Задача1 = Задача;
		Запись.Задача2 = Связанная;
		Запись.Период = ТекущаяДатаСеанса();
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
КонецПроцедуры

// Удалить записи регистра сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  КУдалению - Массив Из ДокументСсылка.cbr_Задача.
Процедура УдалитьСвязиДляЗадачи(Задача, КУдалению) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого Связанная Из КУдалению Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Задача1 = Задача;
		Запись.Задача2 = Связанная;
		Запись.Период = ТекущаяДатаСеанса();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Задача1 = Связанная;
		Запись.Задача2 = Задача;
		Запись.Период = ТекущаяДатаСеанса();
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Удаление);
КонецПроцедуры
#КонецОбласти
#КонецЕсли