
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.МастерРегистрацииОбращения.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
	ПараметрыФормы = Новый Структура("");
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая", ПараметрыФормы,
		 ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		 ПараметрыВыполненияКоманды.Окно,
		 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
