
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбораДанных = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидУсловия");
	Если Параметры.Свойство("ИсточникОткрытияТелефония") Тогда
		ИсточникТелефония = Истина;
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	КонецЕсли;
	ЭлементОтбораДанных.ПравоеЗначение = Перечисления.CRM_ВидыУсловийОбработкиОбращений.СписокТелефонныхНомеров;
	ЭлементОтбораДанных.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если ИсточникТелефония Тогда
		СтандартнаяОбработка = Ложь;
		ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
		
		ПараметрыВвода = Новый Структура("Ключ, ИсточникОткрытияТелефония", ТекущаяСтрока, Истина);

		ОткрытьФорму("Справочник.CRM_УсловияОбработкиОбращений.Форма.ФормаЭлемента", ПараметрыВвода,
			 ЭтотОбъект, УникальныйИдентификатор, , , ,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ИсточникТелефония Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВвода = Новый Структура("ИсточникОткрытияТелефония", Истина);
		
		ОткрытьФорму("Справочник.CRM_УсловияОбработкиОбращений.Форма.ФормаЭлемента", ПараметрыВвода,
			 ЭтотОбъект, , , , ,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
