////////////////////////////////////////////////////////////////////////////////
// Работа с большими языковыми моделями
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура СохранитьСервисПоУмолчанию(Идентификатор) Экспорт
	
	Сервис = Справочники.CRM_СервисыЯзыковыхМоделей.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	ХранилищеОбщихНастроек.Сохранить("CRM_СервисЯзыковыхМоделейПоУмолчанию",, Сервис);

	
КонецПроцедуры

Функция СписокКартинокДействия() Экспорт

	МассивИменКартинок = Новый Массив;
	МассивИменКартинок.Добавить("CRM_ЯМ_Объясни");
	МассивИменКартинок.Добавить("CRM_ЯМ_ОтветьНаВопрос");
	МассивИменКартинок.Добавить("CRM_ЯМ_ВыделиГлавное");
	МассивИменКартинок.Добавить("CRM_ЯМ_СвойЗапрос");
	МассивИменКартинок.Добавить("CRM_ЯМ_Продолжи");
	МассивИменКартинок.Добавить("CRM_ЯМ_ИсправьОшибки");
	МассивИменКартинок.Добавить("CRM_ЯМ_Улучши");
	МассивИменКартинок.Добавить("CRM_ЯМ_Короче");
	МассивИменКартинок.Добавить("CRM_ЯМ_Длиннее");
	МассивИменКартинок.Добавить("CRM_ЯМ_ДобавьСмайлики");
	МассивИменКартинок.Добавить("CRM_ЯМ_Мягче");
	МассивИменКартинок.Добавить("CRM_ЯМ_Жестче");
	МассивИменКартинок.Добавить("CRM_ЯМ_Формальнее");
	МассивИменКартинок.Добавить("CRM_ЯМ_Неформальнее");
	МассивИменКартинок.Добавить("CRM_ЯМ_Английский");
	МассивИменКартинок.Добавить("CRM_ЯМ_Китайский");
	МассивИменКартинок.Добавить("CRM_ЯМ_Русский");
	
	СписокКартинок = Новый СписокЗначений();
	Для Каждого Имя Из МассивИменКартинок Цикл
		МДКартинки = Метаданные.ОбщиеКартинки.Найти(Имя);
		Если МДКартинки <> Неопределено Тогда
			СписокКартинок.Добавить(Имя, МДКартинки.Синоним,, БиблиотекаКартинок[Имя]);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокКартинок;
	
КонецФункции

Функция ПоказатьПредупреждениеПользователя() Экспорт
	Значение = ХранилищеОбщихНастроек.Загрузить("ИИАссистент_ПоказатьПредупреждениеПользователя");
	Возврат (Значение<>Ложь);
КонецФункции

Процедура НеПоказыватьПредупреждениеПользователя() Экспорт
	ХранилищеОбщихНастроек.Сохранить("ИИАссистент_ПоказатьПредупреждениеПользователя",, Ложь);
КонецПроцедуры

Функция ТекстПредупреждения(ИмяМакета) Экспорт
	Возврат Справочники.CRM_СервисыЯзыковыхМоделей.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецФункции

#КонецОбласти
