
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЦветов = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьСписокЦветов();
	ТаблицаЗнач = РеквизитФормыВЗначение("Список");
	Для Каждого Цв Из СписокЦветов Цикл
		НоваяСтрока = ТаблицаЗнач.Добавить();
		НоваяСтрока.Картинка      = Цв.Ключ;
		НоваяСтрока.Представление = Цв.Значение.Представление;
		НоваяСтрока.Красный       = Цв.Значение.Цвет.Красный;
		НоваяСтрока.Зеленый       = Цв.Значение.Цвет.Зеленый;
		НоваяСтрока.Синий         = Цв.Значение.Цвет.Синий;
	КонецЦикла;
	ТаблицаЗнач.Сортировать("Картинка");
	ЗначениеВРеквизитФормы(ТаблицаЗнач, "Список");
	НайденныеСтроки = Список.НайтиСтроки(Новый Структура("Картинка", Параметры.ТекущийЦвет));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Элементы.Список.ТекущаяСтрока = Список.Индекс(НайденныеСтроки[0]);
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Список.НайтиСтроки(Новый Структура("Картинка", Элемент.ТекущиеДанные.Картинка)));
КонецПроцедуры // СписокВыбор() 

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(Список.НайтиСтроки(Новый Структура("Картинка", Элементы.Список.ТекущиеДанные.Картинка)));
КонецПроцедуры // Выбрать()

#КонецОбласти
