#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИБ

// Процедура выполняет заполнение реквизитов предопределенных элементов.
//
Процедура ЗаполнитьПредопределенныеСервисыРассылок() Экспорт

	СправочникОбъект = Справочники.CRM_СервисыРассылок.SMTP.ПолучитьОбъект();
	СправочникОбъект.Включен = Истина;
	СправочникОбъект.Записать();

КонецПроцедуры // ЗаполнитьПредопределенныеКатегорииРешений()

#КонецОбласти // ОбновлениеИБ

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли