
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДосрочноеЗавершение") Тогда
		ЭтоДосрочноеЗавершение = Параметры.ДосрочноеЗавершение;
	Иначе
		ЭтоДосрочноеЗавершение = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ЗавершенДосрочно"				, ЭтоДосрочноеЗавершение);
	СтруктураВозврата.Вставить("ВариантЗавершения"				,
		 ПредопределенноеЗначение("Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно"));
	СтруктураВозврата.Вставить("ПричинаДосрочногоЗавершения"	, ПричинаНеудачногоЗавершения);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
