#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

// Выполняется при Первом запуске
Процедура СоздатьЭлементыПоУмолчанию(Параметры = Неопределено) Экспорт
	
	Наименование = НСтр("ru = 'Отпуск'");
	Если НЕ ЗначениеЗаполнено(НайтиПоНаименованию(Наименование)) Тогда
		НовыйЭлемент = СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Наименование = НСтр("ru = 'Болезнь'");
	Если НЕ ЗначениеЗаполнено(НайтиПоНаименованию(Наименование)) Тогда
		НовыйЭлемент = СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Наименование = НСтр("ru = 'За свой счет'");
	Если НЕ ЗначениеЗаполнено(НайтиПоНаименованию(Наименование)) Тогда
		НовыйЭлемент = СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
