
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НастроитьДоступностьРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДоступностьРеквизитов()
	
	Если Объект.Ссылка = Справочники.CRM_ТипыОтношений.Покупатель Тогда
		Элементы.Клиент.Доступность = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.CRM_ТипыОтношений.Поставщик Тогда
		Элементы.Поставщик.Доступность = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.CRM_ТипыОтношений.Конкурент Тогда
		Элементы.Конкурент.Доступность = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.CRM_ТипыОтношений.Другое Тогда
		Элементы.ПрочиеОтношения.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти