&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	гбХранилище.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	гбХранилищеКлиент.СписокПриАктивизацииСтроки(ЭтаФорма, Элемент);	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбработкаОповещенияНаСервере(ИмяСобытия);
	гбХранилищеКлиент.ОбработкаОповещения_ФормаСписка(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия)
	гбХранилище.ОбработкаОповещения_ФормаСписка(ЭтаФорма, ИмяСобытия);
КонецПроцедуры
