
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
		"CRM_Статистика.АРМДиалоги.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.АРМДиалоги.ОткрытиеВОдинКлик.РазделКлиенты");
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Обработка.CRM_Мессенджер.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		 ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
