#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_ПользовательскиеНастройки.Значение,
		|	cbr_ПользовательскиеНастройки.ВидНастройки
		|ИЗ
		|	РегистрСведений.cbr_ПользовательскиеНастройки КАК cbr_ПользовательскиеНастройки
		|ГДЕ
		|	cbr_ПользовательскиеНастройки.Пользователь = &Пользователь
		|	И
		|		cbr_ПользовательскиеНастройки.ВидНастройки.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.НачальноеЗаполнениеЗадачи)
		|	И НЕ cbr_ПользовательскиеНастройки.ВидНастройки.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Пользователь", Автор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.ВидЗадачи") Тогда
			ВидЗадачи = Выборка.Значение;
			
			КонтрольВремени = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЗадачи, "КонтрольВремени");
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Постановщик") Тогда
			Постановщик = Выборка.Значение;
			Если ТипЗнч(Постановщик) = Тип("СправочникСсылка.Партнеры") Тогда
				КонтактноеЛицо = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Постановщик, "CRM_ОсновноеКонтактноеЛицо");
				ГлавныйМенеджер = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Постановщик, "ОсновнойМенеджер");
			КонецЕсли;
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Приоритет") Тогда
			Приоритет = Выборка.Значение;
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.КонтрольВремени") Тогда
			КонтрольВремени = Выборка.Значение;
			Если КонтрольВремени Тогда
				УчетВремени = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.УчетВремени") Тогда
			Если Не КонтрольВремени Тогда
				УчетВремени = Выборка.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_ВидыЗадач.Партнер,
		|	cbr_ВидыЗадач.Ссылка
		|ИЗ
		|	Справочник.cbr_ВидыЗадач КАК cbr_ВидыЗадач
		|ГДЕ
		|	cbr_ВидыЗадач.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если Не ВыборкаДетальныеЗаписи.Партнер И Не ЗначениеЗаполнено(Постановщик) Тогда
			Постановщик = Автор;
		КонецЕсли;
	КонецЕсли;
	
	Приоритет = Перечисления.cbr_ПриоритетыЗадач.Обычный;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	cbr_ОбработкаТриггеровВызовСервера.ВызовТриггера(Перечисления.cbr_ПодпискаДляТриггера.ПроведениеДокументаЗадача,
		Ссылка);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипЗнч(Постановщик) <> Тип("СправочникСсылка.Партнеры") Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ГлавныйМенеджер");
		ПроверяемыеРеквизиты.Удалить(Индекс);
		Индекс = ПроверяемыеРеквизиты.Найти("КонтактноеЛицо");
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти