#Область ПрограммныйИнтерфейс

// Определяет следующие свойств регламентных заданий:
//  - зависимость от функциональных опций.
//  - возможность выполнения в различных режимах работы программы.
//  - прочие параметры.
//
// Параметры:
//  Настройки - ТаблицаЗначений - таблица значений с колонками:
//    * РегламентноеЗадание - ОбъектМетаданных.РегламентноеЗадание - регламентное задание.
//    * ФункциональнаяОпция - ОбъектМетаданных.ФункциональнаяОпция - функциональная опция,
//        от которой зависит регламентное задание.
//    * ЗависимостьПоИ      - Булево - если регламентное задание зависит более, чем
//        от одной функциональной опции и его необходимо включать только тогда,
//        когда все функциональные опции включены, то следует указывать Истина
//        для каждой зависимости.
//        По умолчанию Ложь - если хотя бы одна функциональная опция включена,
//        то регламентное задание тоже включено.
//    * ВключатьПриВключенииФункциональнойОпции - Булево, Неопределено - если Ложь, то при
//        включении функциональной опции регламентное задание не будет включаться. Значение
//        Неопределено соответствует значению Истина.
//        По умолчанию - неопределено.
//    * ДоступноВПодчиненномУзлеРИБ - Булево, Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в РИБ.
//        По умолчанию - неопределено.
//    * ДоступноВАвтономномРабочемМесте - Булево, Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в автономном рабочем месте.
//        По умолчанию - неопределено.
//    * ДоступноВМоделиСервиса      - Булево, Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в модели сервиса.
//        По умолчанию - неопределено.
//    * РаботаетСВнешнимиРесурсами  - Булево - Истина, если регламентное задание модифицирует данные
//        во внешних источниках (получение почты, синхронизация данных и т.п.). Не следует устанавливать
//        значение Истина, для регламентных заданий, не модифицирующих данные во внешних источниках.
//        Например, регламентное задание ЗагрузкаКурсовВалют. Регламентные задания, работающие с внешними ресурсами,
//        автоматически отключаются в копии информационной базы. По умолчанию - Ложь.
//    * Параметризуется             - Булево - Истина, если регламентное задание параметризованное.
//        По умолчанию - Ложь.
//
// Пример:
//	Настройка = Настройки.Добавить();
//	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбновлениеСтатусовДоставкиSMS;
//	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьПочтовыйКлиент;
//	Настройка.ДоступноВМоделиСервиса = Ложь;
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	// +CRM
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ВыполнениеТриггеров;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОтложенноеВыполнениеТриггеров;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
		
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОбменДаннымиСMSExchange;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьОбменСMSExchange;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОжиданиеСобытийМессенджера;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьИнтеграциюСМессенджерами;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОтправкаОповещенийПоСМС;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьОповещенияСМС;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;	
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОтправкаОповещенийВМессенджер;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьОповещенияМессенджер;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОтправкаОповещенийПоЭлектроннойПочте;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьОповещенияЭлектроннаяПочта;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОтправкаРассылокЭлектронныхПисем;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьРассылкиЭлектронныхПисем;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_СинхронизацияС_iCRM;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользуетсяОбменСiCRM;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ЗагрузкаЛидогенерации;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьСквознуюАналитику;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ЗагрузкаСквознойАналитики;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьСквознуюАналитику;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
		
	// Временно отключено.
	//Настройка = Настройки.Добавить();
	//Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_СвязыватьРанееПолученныеEmailиЗвонкиСКлиентами;
	//Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_СвязыватьРанееПолученныеEmailиЗвонкиСКлиентами;
	//Настройка.РаботаетСВнешнимиРесурсами = Ложь;

	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОбменСИнтернетМагазином;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьИнтеграцииСИнтернетМагазинами;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОчисткаВложенийЭлектронныхПисем;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ОчищатьВложенияЭлектронныхПисем;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.сфпОчисткаСообщенийЖурналаЗвонков;
	Настройка.ФункциональнаяОпция =
		Метаданные.ФункциональныеОпции.сфпИспользоватьРегламентноеЗаданиеОчисткаСообщенийЖурналаЗвонков;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Для НомерПотока = 1 По 10 Цикл
		
		ИмяЗадания = "CRM_ПолучениеИОтправкаЭлектронныхПисемПоток" + НомерПотока;
		
		Настройка = Настройки.Добавить();
		Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания[ИмяЗадания];
		Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьПочтовыйКлиент;
		Настройка.РаботаетСВнешнимиРесурсами = Истина;
		Настройка.ЗависимостьПоИ = Истина;
		Настройка.ВключатьПриВключенииФункциональнойОпции = Ложь;
		
		Настройка = Настройки.Добавить();
		Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания[ИмяЗадания];
		Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьПотокиДоставкиЭлектроннойПочты;
		Настройка.РаботаетСВнешнимиРесурсами = Истина;
		Настройка.ЗависимостьПоИ = Истина;
		Настройка.ВключатьПриВключенииФункциональнойОпции = Ложь;
		
	КонецЦикла;
	
	МетаданныеЗадания = Метаданные.РегламентныеЗадания.ПолучениеИОтправкаЭлектронныхПисем;
	НайденныеСтроки = Настройки.НайтиСтроки(Новый Структура("РегламентноеЗадание", МетаданныеЗадания));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НайденнаяСтрока.ЗависимостьПоИ = Истина;
	КонецЦикла;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = МетаданныеЗадания;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_НеИспользоватьПотокиДоставкиЭлектроннойПочты;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ЗависимостьПоИ = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОбменB2BПортал;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьОбменB2BПортал;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_УдалениеНеактуальныхНапоминаний;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ИспользоватьНапоминанияПользователя;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ФормированиеСоставаЗначенийКлассификаторов;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_ОчисткаИсторииРеквизитовОбъектов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_ОчищатьИсториюРеквизитовОбъектов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.CRM_РасчетВажностиИСрочностиЗадач;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.CRM_РассчитыватьВажностьИСрочностьЗадачАвтоматически;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// -CRM
	
КонецПроцедуры

#КонецОбласти
