#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователи
&НаКлиенте
Процедура ПользователиПользовательПриИзменении(Элемент)
	ПользователиПользовательПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Подбор(Команда)
	ПодборНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПользователиПользовательПриИзмененииНаСервере()
	ТаблицаПользователей = Объект.Пользователи.Выгрузить();
	ТаблицаПользователей.Свернуть("Пользователь");
	Объект.Пользователи.Загрузить(ТаблицаПользователей);
КонецПроцедуры

&НаСервере
Процедура ПодборНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Подразделение В ИЕРАРХИИ (&Подразделение)";

	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Объект.Пользователи.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры
#КонецОбласти